{-# OPTIONS --rewriting #-}

module IntrpTriples where

open import Data.List
open import Relation.Binary.PropositionalEquality hiding (_≗_)
open import Data.Unit
open import Data.Sum
open import Data.Empty
open import Data.Product
-- open import Fma
open import SeqCalc
open import Cut
open import Utilities
open import Mip

_⊩_ : ∀ {Γ Δ Λ C} → (n n' : MIP Γ Δ Λ C) → Set
_⊩_ {Γ} (intrp D₁ g₁ h₁) (intrp D₂ g₂ h₂) = Σ (D₁ ∷ [] ⊢ D₂) λ t → (g₁ ≗ cut Γ t g₂ refl) × (cut [] h₁ t refl ≗ h₂)

data _~_ {Γ Δ Λ : Cxt} {C : Fma} : MIP Γ Δ Λ C → MIP Γ Δ Λ C → Set where
  refl : {n : MIP Γ Δ Λ C} → n ~ n
  ↝∷ : {n n' p : MIP Γ Δ Λ C} 
          → n ⊩ n' → n' ~ p
          → n ~ p
  ↜∷ : {n n' p : MIP Γ Δ Λ C} 
          → n' ⊩ n → n' ~ p
          → n ~ p

∷↝ : {Γ Δ Λ : Cxt} {C : Fma} 
  → {n n' p : MIP Γ Δ Λ C}
  → n ⊩ n' → p ~ n'
  → p ~ n
∷↝ x refl = ↜∷ x refl
∷↝ x (↝∷ y eq) = ↝∷ y (∷↝ x eq)
∷↝ x (↜∷ y eq) = ↜∷ y (∷↝ x eq)

∷↜ : {Γ Δ Λ : Cxt} {C : Fma} 
  → {n n' p : MIP Γ Δ Λ C}
  → n' ⊩ n → p ~ n'
  → p ~ n
∷↜ x refl = ↝∷ x refl
∷↜ x (↝∷ y eq) = ↝∷ y (∷↜ x eq)
∷↜ x (↜∷ y eq) = ↜∷ y (∷↜ x eq)

~-sym : {Γ Δ Λ : Cxt} {C : Fma} 
  → {n n' : MIP Γ Δ Λ C}
  → n ~ n'
  → n' ~ n
~-sym refl = refl
~-sym (↝∷ x eq) = ∷↝ x (~-sym eq)
~-sym (↜∷ x eq) = ∷↜ x (~-sym eq)

~-trans : {Γ Δ Λ : Cxt} {C : Fma} 
  → {n n' n'' : MIP Γ Δ Λ C}
  → n ~ n' → n' ~ n''
  → n ~ n''
~-trans refl eq₂ = eq₂
~-trans (↝∷ x eq₁) eq₂ = ↝∷ x (~-trans eq₁ eq₂)
~-trans (↜∷ x eq₁) eq₂ = ↜∷ x (~-trans eq₁ eq₂)

g~ : ∀ {Γ Δ Λ C D} {g g' : Γ ++ D ∷ Λ ⊢ C} {h : Δ ⊢ D}
  → g ≗ g'
  → intrp D g h ~ intrp D g' h
g~ {Γ} {h = h} p = ↝∷ (ax , (p ∘ (~ cutaxA-left Γ _ refl)) , cutaxA-right h) refl

h~ : ∀ {Γ Δ Λ C D} {g : Γ ++ D ∷ Λ ⊢ C} {h h' : Δ ⊢ D}
  → h ≗ h'
  → intrp D g h ~ intrp D g h'
h~ {Γ} {g = g} {h = h} p = ↝∷ (ax , (~ cutaxA-left Γ g refl) , (cutaxA-right h ∘ p)) refl

cutIL-cases++₁ : (Γ₀ Γ₁ Λ : Cxt) → ∀ {Δ C D}
  → {f : Δ ⊢ D} {g : Γ₀ ++ Γ₁ ++ D ∷ Λ ⊢ C}
  → IL {Γ₀} {Γ₁ ++ Δ ++ Λ} (cut (Γ₀ ++ Γ₁) f g refl) ≡ cut (Γ₀ ++ I ∷ Γ₁) f (IL {Γ₀} {Γ₁ ++ D ∷ Λ} g) refl
cutIL-cases++₁ Γ₀ Γ₁ Λ {D = D}
  rewrite cases++-inj₂ (I ∷ Γ₁) Γ₀ Λ D = refl

cutIL-cases++₂ : (Γ Λ₀ Λ₁ : Cxt) → ∀ {Δ C D}
  → {f : Δ ⊢ D} {g : Γ ++ D ∷ Λ₀ ++ Λ₁ ⊢ C}
  → IL {Γ ++ Δ ++ Λ₀} {Λ₁} (cut Γ f g refl) ≡ cut Γ f (IL {Γ ++ D ∷ Λ₀} {Λ₁} g) refl
cutIL-cases++₂ Γ Λ₀ Λ₁ {D = D}
  rewrite cases++-inj₁ Γ Λ₀ (I ∷ Λ₁) D = refl

IL~Γ' : {Γ₀ Γ₁ Δ Λ : Cxt} {C : Fma}
  → (n : MIP (Γ₀ ++ Γ₁) Δ Λ C)
  → MIP (Γ₀ ++ I ∷ Γ₁) Δ Λ C
IL~Γ' {Γ₀} {Γ₁} {Λ = Λ} (intrp D g h) = intrp D (IL {Γ₀} {Γ₁ ++ D ∷ Λ} g) h

IL~Γ : {Γ₀ Γ₁ Δ Λ : Cxt} {C : Fma}
  → {n n' : MIP (Γ₀ ++ Γ₁) Δ Λ C}
  → n ~ n'
  → IL~Γ' n ~ IL~Γ' n'
IL~Γ refl = refl
IL~Γ {Γ₀} {Γ₁} {Λ = Λ} (↝∷ (t , eqg , eqh) eq) =
  ↝∷ (t , (IL {Γ₀} {Γ₁ ++ _ ∷ Λ} eqg ∘ ≡to≗ (cutIL-cases++₁ Γ₀ Γ₁ Λ)) , eqh) (IL~Γ eq)
IL~Γ {Γ₀} {Γ₁} {Λ = Λ} (↜∷ (t , eqg , eqh) eq) =
  ↜∷ (t , (IL {Γ₀} {Γ₁ ++ _ ∷ Λ} eqg ∘ ≡to≗ (cutIL-cases++₁ Γ₀ Γ₁ Λ)) , eqh) (IL~Γ eq)

IL~Δ' : {Γ Δ₀ Δ₁ Λ : Cxt} {C : Fma}
  → (n : MIP Γ (Δ₀ ++ Δ₁) Λ C)
  → MIP Γ (Δ₀ ++ I ∷ Δ₁) Λ C
IL~Δ' (intrp D g h) = intrp D g (IL h)

IL~Δ : {Γ Δ₀ Δ₁ Λ : Cxt} {C : Fma}
  → {n n' : MIP Γ (Δ₀ ++ Δ₁) Λ C}
  → n ~ n'
  → IL~Δ' n ~ IL~Δ' n'
IL~Δ refl = refl
IL~Δ {Δ₀ = Δ₀} {Δ₁} (↝∷ (t , eqg , eqh) eq) =
  ↝∷ (t , eqg , (cutIL≗ [] Δ₀ Δ₁ _ t refl ∘ IL {Δ₀} {Δ₁ ++ []} eqh)) (IL~Δ eq)
IL~Δ {Δ₀ = Δ₀} {Δ₁} (↜∷ (t , eqg , eqh) eq) =
  ↜∷ (t , eqg , (cutIL≗ [] Δ₀ Δ₁ _ t refl ∘ IL {Δ₀} {Δ₁ ++ []} eqh)) (IL~Δ eq)

IL~Λ' : {Γ Δ Λ₀ Λ₁ : Cxt} {C : Fma}
  → (n : MIP Γ Δ (Λ₀ ++ Λ₁) C)
  → MIP Γ Δ (Λ₀ ++ I ∷ Λ₁) C
IL~Λ' {Γ} {Λ₀ = Λ₀} {Λ₁} (intrp D g h) = intrp D (IL {Γ ++ D ∷ Λ₀} {Λ₁} g) h

IL~Λ : {Γ Δ Λ₀ Λ₁ : Cxt} {C : Fma}
  → {n n' : MIP Γ Δ (Λ₀ ++ Λ₁) C}
  → n ~ n'
  → IL~Λ' n ~ IL~Λ' n'
IL~Λ refl = refl
IL~Λ {Γ} {Λ₀ = Λ₀} {Λ₁} (↝∷ (t , eqg , eqh) eq) =
  ↝∷ (t , (IL {Γ ++ _ ∷ Λ₀} {Λ₁} eqg ∘ ≡to≗ (cutIL-cases++₂ Γ Λ₀ Λ₁)) , eqh) (IL~Λ eq)
IL~Λ {Γ} {Λ₀ = Λ₀} {Λ₁} (↜∷ (t , eqg , eqh) eq) =
  ↜∷ (t , (IL {Γ ++ _ ∷ Λ₀} {Λ₁} eqg ∘ ≡to≗ (cutIL-cases++₂ Γ Λ₀ Λ₁)) , eqh) (IL~Λ eq)

cut⊗L-cases++₁ : (Γ₀ Γ₁ Λ : Cxt) → ∀ {Δ A B C D}
  → {f : Δ ⊢ D} {g : Γ₀ ++ A ∷ B ∷ Γ₁ ++ D ∷ Λ ⊢ C}
  → ⊗L (cut (Γ₀ ++ A ∷ B ∷ Γ₁) f g refl) ≡ cut (Γ₀ ++ A ⊗ B ∷ Γ₁) f (⊗L g) refl
cut⊗L-cases++₁ Γ₀ Γ₁ Λ {A = A} {B} {D = D} 
  rewrite cases++-inj₂ (A ⊗ B ∷ Γ₁) Γ₀ Λ D = refl
cut⊗L-cases++₂ : (Γ Λ₀ Λ₁ : Cxt) → ∀ {Δ A B C D}
  → {f : Δ ⊢ D} {g : Γ ++ D ∷ Λ₀ ++ A ∷ B ∷ Λ₁ ⊢ C}
  → ⊗L {Γ ++ Δ ++ Λ₀} (cut Γ f g refl) ≡ cut Γ f (⊗L {Γ ++ D ∷ Λ₀} g) refl
cut⊗L-cases++₂ Γ Λ₀ Λ₁ {A = A} {B} {D = D} 
  rewrite cases++-inj₁ Γ Λ₀ (A ⊗ B ∷ Λ₁) D = refl

⊗L~Γ' : {Γ₀ Γ₁ Δ Λ : Cxt} {A B C : Fma}   
  → (n : MIP (Γ₀ ++ A ∷ B ∷ Γ₁) Δ Λ C)
  → MIP (Γ₀ ++ A ⊗ B ∷ Γ₁) Δ Λ C
⊗L~Γ' (intrp D g h) = intrp D (⊗L g) h 

⊗L~Γ : {Γ₀ Γ₁ Δ Λ : Cxt} {A B C : Fma}   
  → {n n' : MIP (Γ₀ ++ A ∷ B ∷ Γ₁) Δ Λ C}
  → n ~ n'
  → ⊗L~Γ' n ~ ⊗L~Γ' n' -- For some reason, this lemma cannot be defined directly.
                      -- Agda would take A ⊗ B as the interpolant formula for no reason.
  -- Γ₀ ++ A ∷ B ∷ Γ₁ ++ MIP.D n ∷ Λ ⊢ C
⊗L~Γ refl = refl
⊗L~Γ {Γ₀} {Γ₁} {Λ = Λ} (↝∷ (t , eqg , eqh) eq) = ↝∷ ((t , (⊗L eqg ∘ ≡to≗ (cut⊗L-cases++₁ Γ₀ Γ₁ Λ)) , eqh)) (⊗L~Γ eq)
⊗L~Γ {Γ₀} {Γ₁} {Λ = Λ} (↜∷ (t , eqg , eqh) eq) = ↜∷ ((t , (⊗L eqg ∘ ≡to≗ (cut⊗L-cases++₁ Γ₀ Γ₁ Λ)) , eqh)) (⊗L~Γ eq)

⊗L~Δ : {Γ Δ₀ Δ₁ Λ : Cxt} {A B C : Fma}   
  → {n n' : MIP Γ (Δ₀ ++ A ∷ B ∷ Δ₁) Λ C}
  → n ~ n'
  → intrp (MIP.D n) (MIP.g n) (⊗L (MIP.h n)) ~ intrp (MIP.D n') (MIP.g n') (⊗L (MIP.h n'))
⊗L~Δ refl = refl
⊗L~Δ {Δ₀ = Δ₀} {Δ₁} (↝∷ (t , eqg , eqh) eq) = ↝∷ (t , eqg , (cut⊗L≗ [] Δ₀ Δ₁ _ t refl ∘ ⊗L eqh)) (⊗L~Δ eq)
⊗L~Δ {Δ₀ = Δ₀} {Δ₁} (↜∷ (t , eqg , eqh) eq) = ↜∷ (t , eqg , (cut⊗L≗ [] Δ₀ Δ₁ _ t refl ∘ ⊗L eqh)) (⊗L~Δ eq)

⊗L~Δ' : {Γ Δ₀ Δ₁ Λ : Cxt} {A B C : Fma}
  → (n : MIP Γ (Δ₀ ++ A ∷ B ∷ Δ₁) Λ C)
  → MIP Γ (Δ₀ ++ A ⊗ B ∷ Δ₁) Λ C
⊗L~Δ' (intrp D g h) = intrp D g (⊗L h)

⊗L~Λ : {Γ Δ Λ₀ Λ₁ : Cxt} {A B C : Fma}   
  → {n n' : MIP Γ Δ (Λ₀ ++ A ∷ B ∷ Λ₁) C}
  → n ~ n'
  → intrp (MIP.D n) (⊗L {Γ ++ _ ∷ Λ₀} (MIP.g n)) (MIP.h n) ~ intrp (MIP.D n') (⊗L {Γ ++ _ ∷ Λ₀} (MIP.g n')) (MIP.h n')
⊗L~Λ refl = refl
⊗L~Λ {Γ} {Λ₀ = Λ₀} {Λ₁} (↝∷ (t , eqg , eqh) eq) = ↝∷ (t , (⊗L {Γ ++ _ ∷ Λ₀} eqg ∘ ≡to≗ (cut⊗L-cases++₂ Γ Λ₀ Λ₁)) , eqh) (⊗L~Λ eq)
⊗L~Λ {Γ} {Λ₀ = Λ₀} {Λ₁} (↜∷ (t , eqg , eqh) eq) = ↜∷ (t , (⊗L {Γ ++ _ ∷ Λ₀} eqg ∘ ≡to≗ (cut⊗L-cases++₂ Γ Λ₀ Λ₁)) , eqh) (⊗L~Λ eq)

⊗L~Λ' : {Γ Δ Λ₀ Λ₁ : Cxt} {A B C : Fma}
  → (n : MIP Γ Δ (Λ₀ ++ A ∷ B ∷ Λ₁) C)
  → MIP Γ Δ (Λ₀ ++ A ⊗ B ∷ Λ₁) C
⊗L~Λ' {Γ} {Λ₀ = Λ₀} (intrp D g h) = intrp D (⊗L {Γ ++ D ∷ Λ₀} g) h

⇒R~ : {Γ Δ Λ : Cxt} {A C : Fma}   
  → {n n' : MIP (A ∷ Γ) Δ Λ C}
  → n ~ n'
  → intrp (MIP.D n) (⇒R (MIP.g n)) (MIP.h n) ~ intrp (MIP.D n') (⇒R (MIP.g n')) (MIP.h n')
⇒R~ refl = refl
⇒R~ (↝∷ (t , eqg , eqh) eq) = ↝∷ (t , ⇒R eqg , eqh) (⇒R~ eq)
⇒R~ (↜∷ (t , eqg , eqh) eq) = ↜∷ (t , ⇒R eqg , eqh) (⇒R~ eq)

⇒R~' : {Γ Δ Λ : Cxt} {A C : Fma}
  → (n : MIP (A ∷ Γ) Δ Λ C)
  → MIP Γ Δ Λ (A ⇒ C)
⇒R~' (intrp D g h) = intrp D (⇒R g) h

cut⊗Rcases++₁ : (Γ Λ Ω : Cxt) → ∀ {Δ A B D}
  → {f : Δ ⊢ D} {g : Γ ++ D ∷ Λ ⊢ A} {h : Ω ⊢ B}
  → ⊗R (cut Γ f g refl) h ≡ cut Γ f (⊗R g h) refl
cut⊗Rcases++₁ Γ Λ Ω {D = D} rewrite cases++-inj₁ Γ Λ Ω D = refl
cut⊗Rcases++₂ : (Γ Λ Ω : Cxt) → ∀ {Δ A B D}
  → {f : Δ ⊢ D} {g : Ω ⊢ A} {h : Γ ++ D ∷ Λ ⊢ B} 
  → ⊗R g (cut Γ f h refl) ≡ cut (Ω ++ Γ) f (⊗R g h) refl
cut⊗Rcases++₂ Γ Λ Ω {D = D} rewrite cases++-inj₂ Γ Ω Λ D = refl

cut⊗R⊗Lcases++ : (Γ Λ : Cxt) → ∀ {Δ₀ Δ₁ A B C}
  → {f : Δ₀ ⊢ A} {g : Δ₁ ⊢ B}
  → {h : Γ ++ A ∷ B ∷ Λ ⊢ C} 
  → cut Γ f (cut (Γ ++ A ∷ []) g h refl) refl ≡ cut Γ (⊗R f g) (⊗L h) refl
cut⊗R⊗Lcases++ Γ Λ {A = A} {B} rewrite cases++-inj₂ [] Γ Λ (A ⊗ B) = refl

⊗R~₁ : {Γ Δ Λ Ω : Cxt} {A B : Fma}
  → {n n' : MIP Γ Δ Λ A} 
  → {f f' : Ω ⊢ B}
  → n ~ n'
  → f ≗ f'
  → intrp (MIP.D n) (⊗R (MIP.g n) f) (MIP.h n) ~ intrp (MIP.D n') (⊗R (MIP.g n') f') (MIP.h n')
⊗R~₁ {Γ} {n = n} {f' = f'} refl q = ↝∷ (ax , (⊗R refl q ∘ (~ cutaxA-left Γ (⊗R (MIP.g n) f') refl)) , cutaxA-right (MIP.h n)) refl
⊗R~₁ {Γ} {Λ = Λ} {Ω} (↝∷ (t , eqg , eqh) eq) q = ↝∷ (t , (⊗R eqg refl ∘ ≡to≗ (cut⊗Rcases++₁ Γ Λ Ω)) , eqh) (⊗R~₁ eq q)
⊗R~₁ {Γ} {Λ = Λ} {Ω} (↜∷ (t , eqg , eqh) eq) q = ↜∷ (t , (⊗R eqg refl ∘ ≡to≗ (cut⊗Rcases++₁ Γ Λ Ω)) , eqh) (⊗R~₁ eq q)

⊗R~₁' : {Γ Δ Λ Ω : Cxt} {A B : Fma}
  → (n : MIP Γ Δ Λ A)
  → (f : Ω ⊢ B)
  → MIP Γ Δ (Λ ++ Ω) (A ⊗ B)
⊗R~₁' (intrp D g h) f = intrp D (⊗R g f) h

⊗R~₂' : {Γ Δ Λ Ω : Cxt} {A B : Fma}   
  → (n : MIP Γ Δ Λ B) 
  → (f : Ω ⊢ A)
  → MIP (Ω ++ Γ) Δ Λ (A ⊗ B)
⊗R~₂' (intrp D g h) f = intrp D (⊗R f g) h

⊗R~₂ : {Γ Δ Λ Ω : Cxt} {A B : Fma}
  → {n n' : MIP Γ Δ Λ B} 
  → {f f' : Ω ⊢ A}
  → n ~ n'
  → f ≗ f'
  → ⊗R~₂' n f ~ ⊗R~₂' n' f'
⊗R~₂ {Γ} {Ω = Ω} {n = n} {f' = f'} refl q = ↝∷ (ax , (⊗R q refl ∘ (~ cutaxA-left (Ω ++ Γ) (⊗R f' (MIP.g n)) refl)) , cutaxA-right _) refl
⊗R~₂ {Γ} {Λ = Λ} {Ω} (↝∷ (t , eqg , eqh) eq) q = ↝∷ (t , (⊗R refl eqg ∘ ≡to≗(cut⊗Rcases++₂ Γ Λ Ω)) , eqh) (⊗R~₂ eq q)
⊗R~₂ {Γ} {Λ = Λ} {Ω} (↜∷ (t , eqg , eqh) eq) q = ↜∷ (t , (⊗R refl eqg ∘ ≡to≗(cut⊗Rcases++₂ Γ Λ Ω)) , eqh) (⊗R~₂ eq q)

⊗R~' : ∀ {Γ Δ₀ Δ₁ Λ A B}
  → (n : MIP Γ Δ₀ [] A) (n' : MIP [] Δ₁ Λ B)
  → MIP Γ (Δ₀ ++ Δ₁) Λ (A ⊗ B)
⊗R~' (intrp D g h) (intrp E g' h') = intrp (D ⊗ E) (⊗L (⊗R g g')) (⊗R h h')

⊗R~ : ∀ {Γ Δ₀ Δ₁ Λ A B}
  → {n n' : MIP Γ Δ₀ [] A} {m m' : MIP [] Δ₁ Λ B}
  → n ~ n' → m ~ m'
  → ⊗R~' n m ~ ⊗R~' n' m'
⊗R~ refl refl = refl
⊗R~ {Γ} {Λ = Λ} {n = n} refl (↝∷ {n' = m} (t , eqg , eqh) q) 
  = ↝∷ (⊗L {[]} (⊗R ax t) , (⊗L (((⊗R refl eqg ∘ ≡to≗ (cut⊗Rcases++₂ [] Λ (Γ ++ MIP.D n ∷ []))) 
    ∘ (~ cutaxA-left Γ (cut (Γ ++ MIP.D n ∷ []) t (⊗R (MIP.g n) (MIP.g m)) refl) refl)) ∘ ≡to≗ (cut⊗R⊗Lcases++ Γ Λ)) 
    ∘ (~ cut⊗L≗ Γ [] [] (⊗R ax t) (⊗L (⊗R (MIP.g n) (MIP.g m))) refl)) , 
    ⊗R (cutaxA-right _) eqh) 
    (⊗R~ refl q)
⊗R~ {Γ} {Λ = Λ} {n = n} {m = m} refl (↜∷ (t , eqg , eqh) q) 
  = ↜∷ (⊗L {[]} (⊗R ax t) , (⊗L (((⊗R refl eqg ∘ ≡to≗ (cut⊗Rcases++₂ [] Λ (Γ ++ MIP.D n ∷ []))) 
    ∘ (~ cutaxA-left Γ (cut (Γ ++ MIP.D n ∷ []) t (⊗R (MIP.g n) (MIP.g m)) refl) refl)) ∘ ≡to≗ (cut⊗R⊗Lcases++ Γ Λ)) 
    ∘ (~ cut⊗L≗ Γ [] [] (⊗R ax t) (⊗L (⊗R (MIP.g n) (MIP.g m))) refl)) , 
  ⊗R (cutaxA-right _) eqh) 
    (⊗R~ refl q)
⊗R~ {Γ} {Λ = Λ} {m = m} (↝∷ {n' = n'} (t , eqg , eqh) p) q 
  = ↝∷ (⊗L {[]} (⊗R t ax) , (⊗L (((⊗R eqg refl ∘ ≡to≗ (cut⊗Rcases++₁ Γ [] (MIP.D m ∷ Λ))) 
    ∘ (~ cut-cong₂ Γ refl (cutaxA-left (Γ ++ MIP.D n' ∷ []) (⊗R (MIP.g n') (MIP.g m)) refl))) ∘ ≡to≗ (cut⊗R⊗Lcases++ Γ Λ)) 
    ∘ (~ cut⊗L≗ Γ [] [] (⊗R t ax) (⊗L (⊗R (MIP.g n') (MIP.g m))) refl)) , 
    (⊗R refl (cutaxA-right _) ∘ ⊗R eqh refl)) 
    (⊗R~ p q)
⊗R~ {Γ} {Λ = Λ} {n = n} {m = m} (↜∷ (t , eqg , eqh) p) q 
  = ↜∷ (⊗L {[]} (⊗R t ax) , (⊗L (((⊗R eqg refl ∘ ≡to≗ (cut⊗Rcases++₁ Γ [] (MIP.D m ∷ Λ))) 
    ∘ (~ cut-cong₂ Γ refl (cutaxA-left (Γ ++ MIP.D n ∷ []) (⊗R (MIP.g n) (MIP.g m)) refl))) ∘ ≡to≗ (cut⊗R⊗Lcases++ Γ Λ)) 
    ∘ (~ cut⊗L≗ Γ [] [] (⊗R t ax) (⊗L (⊗R (MIP.g n) (MIP.g m))) refl)) , 
    (⊗R refl (cutaxA-right _) ∘ ⊗R eqh refl)) 
    (⊗R~ p q)

⇒L~Γ' : {Γ₀ Γ₁ Δ Λ Ω : Cxt} {A B C : Fma}   
  → (n : MIP (Γ₀ ++ B ∷ Γ₁) Δ Λ C)
  → (f : Ω ⊢ A)
  → MIP (Γ₀ ++ Ω ++ A ⇒ B ∷ Γ₁) Δ Λ C
⇒L~Γ' (intrp D g h) f = intrp D (⇒L f g) h

cut⇒L-cases++-comm₁ : (Γ₀ : Cxt) → ∀ {Γ₁ Δ Λ Ω A B C D}
  → {f : Ω ⊢ D} 
  → {g : Δ ⊢ A} {h : Γ₀ ++ B ∷ Γ₁ ++ D ∷ Λ ⊢ C}
  → cut (Γ₀ ++ Δ ++ A ⇒ B ∷ Γ₁) f (⇒L g h) refl ≡ ⇒L g (cut (Γ₀ ++ B ∷ Γ₁) f h refl)
cut⇒L-cases++-comm₁ Γ₀ {Γ₁} {Δ} {Λ} {A = A} {B} {D = D} 
  rewrite cases++-inj₂ (A ⇒ B ∷ Γ₁) (Γ₀ ++ Δ) Λ D = refl

⇒L~Γ : {Γ₀ Γ₁ Δ Λ Ω : Cxt} {A B C : Fma}   
  → {n n' : MIP (Γ₀ ++ B ∷ Γ₁) Δ Λ C}
  → {f f' : Ω ⊢ A}
  → n ~ n' → f ≗ f'
  → ⇒L~Γ' n f ~ ⇒L~Γ' n' f'
⇒L~Γ {Γ₀} {Γ₁} {Λ = Λ} {Ω} {A} {B} {n = n} {f' = f'} refl p 
  = ↝∷ (ax , (⇒L p refl ∘ (~ cutaxA-left (Γ₀ ++ Ω ++ A ⇒ B ∷ Γ₁) (⇒L f' (MIP.g n)) refl)) , cutaxA-right _) refl
⇒L~Γ {Γ₀} {Γ₁} {Λ = Λ} {Ω} {A} {B} (↝∷ (t , eqg , eqh) eq) p 
  = ↝∷ (t , (⇒L refl eqg ∘ (~ (≡to≗ (cut⇒L-cases++-comm₁ Γ₀)))) , eqh) (⇒L~Γ eq p)
⇒L~Γ {Γ₀} {Γ₁} {Λ = Λ} {Ω} {A} {B} (↜∷ (t , eqg , eqh) eq) p 
  = ↜∷ (t , (⇒L refl eqg ∘ (~ (≡to≗ (cut⇒L-cases++-comm₁ Γ₀)))) , eqh) (⇒L~Γ eq p)

⇒L~Δ' : {Γ Γ₁ Δ Λ Λ₁ : Cxt} {A B C : Fma}   
  → (n : MIP Γ Δ Λ A)
  → (f : Γ₁ ++ B ∷ Λ₁ ⊢ C)
  → MIP (Γ₁ ++ Γ) Δ (Λ ++ A ⇒ B ∷ Λ₁) C
⇒L~Δ'  (intrp D g h) f = intrp D (⇒L g f) h

cut⇒L-cases++₁ : (Γ Γ₁ : Cxt) → ∀ {Λ Λ₁ Ω A B C D}
  → {f : Ω ⊢ D} 
  → {g : Γ ++ D ∷ Λ ⊢ A} {h : Γ₁ ++ B ∷ Λ₁ ⊢ C}
  → cut (Γ₁ ++ Γ) f (⇒L g h) refl ≡ ⇒L (cut Γ f g refl) h
cut⇒L-cases++₁ Γ Γ₁ {Λ} {Λ₁} {A = A} {B} {D = D} 
  rewrite cases++-inj₁ (Γ₁ ++ Γ) Λ (A ⇒ B ∷ Λ₁) D | 
          cases++-inj₂ Γ Γ₁ Λ D = refl
⇒L~Δ : {Γ Γ₁ Δ Λ Λ₁ : Cxt} {A B C : Fma}   
  → {n n' : MIP Γ Δ Λ A}
  → {f f' : Γ₁ ++ B ∷ Λ₁ ⊢ C}
  → n ~ n' → f ≗ f'
  → ⇒L~Δ' n f ~ ⇒L~Δ' n' f'
⇒L~Δ {Γ} {Γ₁} {n = n} {f' = f'} refl p = ↝∷ (ax , (⇒L refl p ∘ (~ cutaxA-left (Γ₁ ++ Γ) (⇒L (MIP.g n) f') refl)) , cutaxA-right _) refl
⇒L~Δ {Γ} {Γ₁} (↝∷ (t , eqg , eqh) eq) p = ↝∷ (t , (⇒L eqg refl ∘ (~ ≡to≗ (cut⇒L-cases++₁ Γ Γ₁))) , eqh) (⇒L~Δ eq p)
⇒L~Δ {Γ} {Γ₁} (↜∷ (t , eqg , eqh) eq) p = ↜∷ (t , (⇒L eqg refl ∘ (~ ≡to≗ (cut⇒L-cases++₁ Γ Γ₁))) , eqh) (⇒L~Δ eq p)

⇒L~Λ' : {Γ Δ Λ₀ Λ₁ Ω : Cxt} {A B C : Fma}   
  → (n : MIP Γ Δ (Λ₀ ++ B ∷ Λ₁) C)
  → (f : Ω ⊢ A)
  → MIP Γ Δ (Λ₀ ++ Ω ++ A ⇒ B ∷ Λ₁) C
⇒L~Λ' {Γ} {Λ₀ = Λ₀} (intrp D g h) f = intrp D (⇒L {Γ ++ _ ∷ Λ₀} f g) h

cut⇒L-cases++-comm₂ : (Γ Λ₀ : Cxt) → ∀ {Δ Λ₁ Ω A B C D}
  → {f : Ω ⊢ D} 
  → {g : Δ ⊢ A} {h : Γ ++ D ∷ Λ₀ ++ B ∷ Λ₁ ⊢ C}
  → cut Γ f (⇒L {Γ ++ D ∷ Λ₀} g h) refl ≡ ⇒L {Γ ++ Ω ++ Λ₀} g (cut Γ f h refl)
cut⇒L-cases++-comm₂ Γ Λ₀ {Δ} {Λ₁} {A = A} {B} {D = D} 
  rewrite cases++-inj₁ Γ (Λ₀ ++ Δ) (A ⇒ B ∷ Λ₁) D |
          cases++-inj₁ Γ Λ₀ Δ D = refl
⇒L~Λ : {Γ Δ Λ₀ Λ₁ Ω : Cxt} {A B C : Fma}   
  → {n n' : MIP Γ Δ (Λ₀ ++ B ∷ Λ₁) C}
  → {f f' : Ω ⊢ A}
  → n ~ n'
  → f ≗ f'
  → ⇒L~Λ' n f ~ ⇒L~Λ' n' f'
⇒L~Λ {Γ} {Λ₀ = Λ₀} {n = n} {f' = f'} refl p 
  = ↝∷ (ax , (⇒L p refl ∘ (~ cutaxA-left Γ (⇒L {Γ ++ _ ∷ Λ₀} f' (MIP.g n)) refl)) , cutaxA-right _) refl
⇒L~Λ {Γ} {Λ₀ = Λ₀} (↝∷ (t , eqg , eqh) eq) p = ↝∷ (t , (⇒L refl eqg ∘ (~ ≡to≗ (cut⇒L-cases++-comm₂ Γ Λ₀))) , eqh) (⇒L~Λ eq p)
⇒L~Λ {Γ} {Λ₀ = Λ₀} (↜∷ {n' = n'} (t , eqg , eqh) eq) p 
  = ↜∷ (t , (⇒L {Γ ++ MIP.D n' ∷ Λ₀} refl eqg ∘ (~ ≡to≗ (cut⇒L-cases++-comm₂ Γ Λ₀))) , eqh) (⇒L~Λ eq p)

⇒L~ΓΛ' : {Γ₀ Γ₁ Λ₀ Λ₁ Ω : Cxt} {A B C : Fma}   
  → (n : MIP Γ₀ (Γ₁ ++ B ∷ Λ₀) Λ₁ C)
  → (f : Ω ⊢ A)
  → MIP Γ₀ (Γ₁ ++ Ω ++ A ⇒ B ∷ Λ₀) Λ₁ C
⇒L~ΓΛ' (intrp D g h) f = intrp D g (⇒L f h)

⇒L~ΓΛ : {Γ₀ Γ₁ Λ₀ Λ₁ Ω : Cxt} {A B C : Fma}   
  → {n n' : MIP Γ₀ (Γ₁ ++ B ∷ Λ₀) Λ₁ C}
  → {f f' : Ω ⊢ A}
  → n ~ n' → f ≗ f'
  → ⇒L~ΓΛ' n f ~ ⇒L~ΓΛ' n' f'
⇒L~ΓΛ {Γ₀} {n = n} refl p = ↝∷ (ax , (~ cutaxA-left Γ₀ (n .MIP.g) refl) , (cutaxA-right _ ∘ ⇒L p refl)) refl
⇒L~ΓΛ {n = n} {f = f} (↝∷ {n' = n'} (t , eqg , eqh) eq) p  
  = ↝∷ (t , eqg , (cut⇒L≗ [] f (n .MIP.h) t refl ∘ ⇒L refl eqh)) (⇒L~ΓΛ eq p)
⇒L~ΓΛ {n = n'} {f = f} (↜∷ {n' = n} (t , eqg , eqh) eq) p 
  = ↜∷ (t , eqg , (cut⇒L≗ [] f (n .MIP.h) t refl ∘ ⇒L refl eqh)) (⇒L~ΓΛ eq p)

⇒L~⇒' : ∀ {Γ Δ₀ Δ₁ Λ₀ Λ₁ A B C}
  → (n : MIP [] Δ₀ Δ₁ A) (m : MIP Γ (B ∷ Λ₀) Λ₁ C)
  → MIP (Γ ++ Δ₀) (Δ₁ ++ A ⇒ B ∷ Λ₀) Λ₁ C
⇒L~⇒' (intrp D g h) (intrp E g' h') = intrp (D ⇒ E) (⇒L h g') (⇒R (⇒L {[]} g h'))

cut⇒R⇒Lcases++ : (Γ Λ Ω : Cxt) → ∀ {Δ A B C}
  → {f : A ∷ Δ ⊢ B}
  → {g : Ω ⊢ A} {h : Γ ++ B ∷ Λ ⊢ C}
  → cut (Γ ++ Ω) (⇒R f) (⇒L g h) refl ≡ cut Γ g (cut Γ f h refl) refl
cut⇒R⇒Lcases++ Γ Λ Ω {A = A} {B} 
  rewrite cases++-inj₂ [] (Γ ++ Ω) Λ (A ⇒ B) = refl

cut⇒L-cases++-assoc : (Γ₀ Γ₁ : Cxt) → ∀ {Λ₀ Λ₁ Ω A B C D}
  → {f : Ω ⊢ D} 
  → {g : Γ₀ ++ D ∷ Λ₀ ⊢ A} {h : Γ₁ ++ B ∷ Λ₁ ⊢ C}
  → cut (Γ₁ ++ Γ₀) f (⇒L g h) refl ≡ ⇒L (cut Γ₀ f g refl) h
cut⇒L-cases++-assoc Γ₀ Γ₁ {Λ₀ = Λ₀} {Λ₁} {A = A} {B} {D = D} 
  rewrite cases++-inj₁ (Γ₁ ++ Γ₀) Λ₀ (A ⇒ B ∷ Λ₁) D |
          cases++-inj₂ Γ₀ Γ₁ Λ₀ D = refl

⇒L~⇒ : ∀ {Γ Δ₀ Δ₁ Λ₀ Λ₁ A B C}
  → {n n' : MIP [] Δ₀ Δ₁ A} {m m' : MIP Γ (B ∷ Λ₀) Λ₁ C}
  → n ~ n' → m ~ m'
  → ⇒L~⇒' n m ~ ⇒L~⇒' n' m' 
⇒L~⇒ refl refl = refl
⇒L~⇒ {Γ} {Δ₀} {Λ₁ = Λ₁} {n = intrp D g h} refl (↝∷ {n = intrp E g' h'} {n' = intrp F g'' h''} (t , eqg , eqh) q) 
  = ↝∷ (⇒R (⇒L {[]} ax t) , 
    ((⇒L (~ cutaxA-right _) eqg ∘ (~ ≡to≗ (cut⇒L-cases++-assoc [] Γ))) 
    ∘ (~ cut-cong₂ Γ refl (cut⇒L≗ Γ ax t g'' refl))) 
    ∘ (~ ≡to≗ (cut⇒R⇒Lcases++ Γ Λ₁ Δ₀)) , 
    ⇒R (cutaxA-left [] (cut [] (⇒L g h') t refl) refl 
    ∘ (cut⇒L≗ [] g h' t refl ∘ ⇒L refl eqh))) (⇒L~⇒ refl q)
⇒L~⇒ {Γ} {Δ₀} {Λ₁ = Λ₁} {n = intrp D g h} refl (↜∷ {n = intrp E g' h'} {n' = intrp F g'' h''} (t , eqg , eqh) q) 
  = ↜∷ (⇒R (⇒L {[]} ax t) , 
    (((⇒L (~ cutaxA-right _) eqg ∘ (~ ≡to≗ (cut⇒L-cases++-assoc [] Γ))) 
    ∘ (~ cut-cong₂ Γ refl (cut⇒L≗ Γ ax t g' refl))) 
    ∘ (~ ≡to≗ (cut⇒R⇒Lcases++ Γ Λ₁ Δ₀))) , 
    ⇒R (cutaxA-left [] (cut [] (⇒L g h'') t refl) refl  
    ∘ (cut⇒L≗ [] g h'' t refl ∘ ⇒L refl eqh))) (⇒L~⇒ refl q)
⇒L~⇒ {Γ} {Δ₀} {Λ₁ = Λ₁} {n = intrp D g h} {m = intrp E g' h'} (↝∷ {n' = intrp F g'' h''} (t , eqg , eqh) p) q 
  = ↜∷ (⇒R (⇒L {[]} t ax) , 
    ((⇒L (~ eqh) (~ cutaxA-left Γ g' refl) ∘ (~ ≡to≗ (cut⇒L-cases++-assoc [] Γ))) 
    ∘ (~ cut-cong₂ Γ refl (cut⇒L≗ Γ t ax g' refl))) ∘ (~ (≡to≗ (cut⇒R⇒Lcases++ Γ Λ₁ Δ₀))) , 
    ⇒R (refl ∘ ⇒L (~ eqg) (cutaxA-right _))) (⇒L~⇒ p q)
    -- refl in refl ∘ ⇒L (~ eqg) (cutaxA-right _)) was "cut-cong₂ [] refl (cut⇒L≗ [] g'' h' ax refl)""
  {-
  Our goal is ⇒L~⇒' (intrp D g h) (intrp E g' h') ~ ⇒L~⇒' n' m' while
  by I.H. we have ⇒L~⇒' (intrp F g'' h'') (intrp E g' h') ~ ⇒L~⇒' n' m',
  therefore we need to provide a proof of ⇒L~⇒' (intrp D g h) (intrp E g' h') ⊩ ⇒L~⇒' (intrp F g'' h'') (intrp E g' h').
  Given t : D ⊢ F from I.H., we can only construct F ⇒ E ⊢ D ⇒ E.
  Therefore we swap to ↜∷ in the goal.
  -}
⇒L~⇒ {Γ} {Δ₀} {Λ₁ = Λ₁} {n = intrp D g h} {m = intrp E g' h'} (↜∷ {n' = intrp F g'' h''} (t , eqg , eqh) p) q 
  = ↝∷ (⇒R (⇒L {[]} t ax) , (((⇒L (~ eqh) (~ cutaxA-left Γ g' refl) ∘ (~ ≡to≗ (cut⇒L-cases++-assoc [] Γ))) 
    ∘ (~ cut-cong₂ Γ refl (cut⇒L≗ Γ t ax g' refl))) ∘ (~ (≡to≗ (cut⇒R⇒Lcases++ Γ Λ₁ Δ₀)))) , 
    ⇒R (refl ∘ ⇒L (~ eqg) (cutaxA-right _))) (⇒L~⇒ p q)
    -- refl in refl ∘ ⇒L (~ eqg) (cutaxA-right _)) was "cut-cong₂ [] refl (cut⇒L≗ [] g h' ax refl)"" 

⇒L~⊗' : ∀ {Γ₀ Γ₁ Δ₀ Δ₁ Λ A B C}
  → (n : MIP [] Δ₀ Δ₁ A) (m : MIP Γ₀ Γ₁ (B ∷ Λ) C)
  → MIP Γ₀ (Γ₁ ++ Δ₀) (Δ₁ ++ A ⇒ B ∷ Λ) C
⇒L~⊗' (intrp D g h) (intrp E g' h') = intrp (E ⊗ D) (⊗L (⇒L {_ ++ _ ∷ []} g g')) (⊗R h' h)

⇒L~⊗ : ∀ {Γ₀ Γ₁ Δ₀ Δ₁ Λ A B C}
  → {n n' : MIP [] Δ₀ Δ₁ A} {m m' : MIP Γ₀ Γ₁ (B ∷ Λ) C}
  → n ~ n' → m ~ m'
  → ⇒L~⊗' n m ~ ⇒L~⊗' n' m' 
⇒L~⊗ refl refl = refl
⇒L~⊗ {Γ₀} {Δ₁ = Δ₁} {Λ} {A} {B} {n = intrp D g h} {m = intrp E g' h'} refl (↝∷ {n' = intrp F g'' h''} (t , eqg , eqh) q) 
  = ↝∷ (⊗L {[]} (⊗R t ax) , 
    ⊗L (((⇒L refl eqg ∘ (~ (≡to≗ (cut⇒L-cases++-comm₂ Γ₀ [])))) 
    ∘ (~ cut-cong₂ Γ₀ refl (cutaxA-left (Γ₀ ++ F ∷ []) (⇒L {Γ₀ ++ F ∷ []} g g'') refl))) 
    ∘ ≡to≗ (cut⊗R⊗Lcases++ Γ₀ (Δ₁ ++ A ⇒ B ∷ Λ) {f = t} {ax} {⇒L {Γ₀ ++ F ∷ []} g g''})) 
    ∘ (~ cut⊗L≗ Γ₀ [] [] (⊗R t ax) (⊗L {Γ₀} (⇒L {Γ₀ ++ F ∷ []} g g'')) refl) , 
    ⊗R eqh (cutaxA-right _)) 
    (⇒L~⊗ refl q)
⇒L~⊗ {Γ₀} {Δ₁ = Δ₁} {Λ} {A} {B} {n = intrp D g h} {m = intrp E g' h'} refl (↜∷ {n' = intrp F g'' h''} (t , eqg , eqh) q) 
  = ↜∷ (⊗L {[]} (⊗R t ax) , 
    (⊗L ((⇒L {Γ₀ ++ F ∷ []} refl eqg ∘ ((~ (≡to≗ (cut⇒L-cases++-comm₂ Γ₀ []))) 
    ∘ (~ cut-cong₂ Γ₀ refl (cutaxA-left (Γ₀ ++ E ∷ []) (⇒L {Γ₀ ++ E ∷ []} g g') refl)))) 
    ∘ ≡to≗ (cut⊗R⊗Lcases++ Γ₀ (Δ₁ ++ A ⇒ B ∷ Λ) {f = t} {ax} {⇒L {Γ₀ ++ E ∷ []} g g'}))
    ∘ (~ cut⊗L≗ Γ₀ [] [] (⊗R t ax) (⊗L {Γ₀} (⇒L {Γ₀ ++ E ∷ []} g g')) refl)) ,
    ⊗R eqh (cutaxA-right _)) 
    (⇒L~⊗ refl q)
    
⇒L~⊗ {Γ₀} {Δ₁ = Δ₁} {Λ} {A} {B} {n = intrp D g h} {m = intrp E g' h'} (↝∷ {n' = intrp F g'' h''} (t , eqg , eqh) p) q 
  = ↝∷ (⊗L {[]} (⊗R ax t) , 
    ⊗L (((⇒L eqg refl 
    ∘ (~ (≡to≗ (cut⇒L-cases++-assoc [] (Γ₀ ++ E ∷ []))))) 
    ∘ (~ cutaxA-left Γ₀ (cut (Γ₀ ++ E ∷ []) t (⇒L {Γ₀ ++ E ∷ []} g'' g') refl) refl)) 
    ∘ ≡to≗ (cut⊗R⊗Lcases++ Γ₀ (Δ₁ ++ A ⇒ B ∷ Λ) {f = ax} {t} {⇒L {Γ₀ ++ E ∷ []} g'' g'})) 
    ∘ (~ cut⊗L≗ Γ₀ [] [] (⊗R ax t) (⊗L {Γ₀} (⇒L {Γ₀ ++ E ∷ []} g'' g')) refl) , 
    ⊗R (cutaxA-right _) eqh) 
    (⇒L~⊗ p q)
⇒L~⊗ {Γ₀} {Δ₁ = Δ₁} {Λ} {A} {B} {n = intrp D g h} {m = intrp E g' h'} (↜∷ {n' = intrp F g'' h''} (t , eqg , eqh) p) q 
  = ↜∷ (⊗L {[]} (⊗R ax t) , 
    (⊗L (((⇒L eqg refl 
    ∘ (~ (≡to≗ (cut⇒L-cases++-assoc [] (Γ₀ ++ E ∷ []))))) 
    ∘ (~ cutaxA-left Γ₀ (cut (Γ₀ ++ E ∷ []) t (⇒L {Γ₀ ++ E ∷ []} g g') refl) refl)) 
    ∘ ≡to≗ (cut⊗R⊗Lcases++ Γ₀ (Δ₁ ++ A ⇒ B ∷ Λ) {f = ax} {t} {⇒L {Γ₀ ++ E ∷ []} g g'})) 
    ∘ (~ cut⊗L≗ Γ₀ [] [] (⊗R ax t) (⊗L {Γ₀} (⇒L {Γ₀ ++ E ∷ []} g g')) refl)) , 
    ⊗R (cutaxA-right _) eqh) 
    (⇒L~⊗ p q)

⇒L⇒R~Γ : ∀ {Γ₀ Γ₁ Δ Λ Ω A B A' B'}
  → (n : MIP (A' ∷ Γ₀ ++ B ∷ Γ₁) Δ Λ B')
  → (f : Ω ⊢ A)
  → ⇒L~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} (⇒R~' n) f ~ ⇒R~' (⇒L~Γ' n f)
⇒L⇒R~Γ (intrp D g h) f = g~ ⇒L⇒R

⇒L⇒R~⇒ : ∀ {Γ Δ₀ Δ₁ Λ₀ Λ₁ A B A' B'}
  → (n : MIP [] Δ₀ Δ₁ A)
  → (m : MIP (A' ∷ Γ) (B ∷ Λ₀) Λ₁ B')
  → ⇒L~⇒' n (⇒R~' m) ~ ⇒R~' (⇒L~⇒' n m)
⇒L⇒R~⇒ (intrp D g h) (intrp E g' h') = g~ ⇒L⇒R

⇒L⇒R~ΓΛ : ∀ {Γ₀ Γ₁ Λ₀ Λ₁ Ω A B A' C}
  → (n : MIP (A' ∷ Γ₀) (Γ₁ ++ B ∷ Λ₀) Λ₁ C)
  → (f : Ω ⊢ A)
  → ⇒L~ΓΛ' (⇒R~' n) f ~ ⇒R~' (⇒L~ΓΛ' n f)
⇒L⇒R~ΓΛ (intrp D g h) f = refl

⇒L⇒R~⊗ : ∀ {Γ₀ Γ₁ Δ₀ Δ₁ Λ A B A' B'}
  → (n : MIP [] Δ₀ Δ₁ A)
  → (m : MIP (A' ∷ Γ₀) Γ₁ (B ∷ Λ) B')
  → ⇒L~⊗' n (⇒R~' m) ~ ⇒R~' (⇒L~⊗' n m)
⇒L⇒R~⊗ (intrp D g h) (intrp E g' h') = g~ (⊗L ⇒L⇒R ∘ ⊗L⇒R)

⇒L⇒R~Δ : ∀ {Γ Γ₁ Δ Λ Λ₁ A B A' B'}
  → (n : MIP Γ Δ Λ A)
  → (g : A' ∷ Γ₁ ++ B ∷ Λ₁ ⊢ B')
  → ⇒L~Δ' n (⇒R g) ~ ⇒R~' (⇒L~Δ' n g)
⇒L⇒R~Δ (intrp D g' h) g = g~ ⇒L⇒R

⇒L⇒R~Λ : ∀ {Γ Δ Λ₀ Λ₁ Ω A B A' B'}
  → (n : MIP (A' ∷ Γ) Δ (Λ₀ ++ B ∷ Λ₁) B')
  → (f : Ω ⊢ A)
  → ⇒L~Λ' (⇒R~' n) f ~ ⇒R~' (⇒L~Λ' n f)
⇒L⇒R~Λ (intrp D g h) f = g~ ⇒L⇒R

⊗L⇒R~Γ : ∀ {Γ₀ Γ₁ Δ Λ A B A' C}
  → (n : MIP (A' ∷ Γ₀ ++ A ∷ B ∷ Γ₁) Δ Λ C)
  → ⊗L~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} (⇒R~' n) ~ ⇒R~' (⊗L~Γ' {Γ₀ = A' ∷ Γ₀} {Γ₁ = Γ₁} n)
⊗L⇒R~Γ {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Λ = Λ} {A = A} {B = B} {A' = A'} {C = C} (intrp D g h) =
  g~ (⊗L⇒R {Γ = Γ₀} {Δ = Γ₁ ++ D ∷ Λ} {A = A} {B = B} {A' = A'} {B' = C})

⊗L⇒R~Δ : ∀ {Γ Δ₀ Δ₁ Λ A B A' C}
  → (n : MIP (A' ∷ Γ) (Δ₀ ++ A ∷ B ∷ Δ₁) Λ C)
  → ⊗L~Δ' (⇒R~' n) ~ ⇒R~' (⊗L~Δ' n)
⊗L⇒R~Δ (intrp D g h) = refl

⊗L⇒R~Λ : ∀ {Γ Δ Λ₀ Λ₁ A B A' C}
  → (n : MIP (A' ∷ Γ) Δ (Λ₀ ++ A ∷ B ∷ Λ₁) C)
  → ⊗L~Λ' (⇒R~' n) ~ ⇒R~' (⊗L~Λ' n)
⊗L⇒R~Λ {Γ = Γ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} {A = A} {B = B} {A' = A'} {C = C} (intrp D g h) =
  g~ (⊗L⇒R {Γ = Γ ++ D ∷ Λ₀} {Δ = Λ₁} {A = A} {B = B} {A' = A'} {B' = C})

IL⊗R₁~Γ : ∀ {Γ₀ Γ₁ Δ Λ Ω A B}
  → (n : MIP (Γ₀ ++ Γ₁) Δ Λ A)
  → (f : Ω ⊢ B)
  → IL~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ} {Λ = Λ ++ Ω} (⊗R~₁' n f)
      ~ ⊗R~₁' (IL~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ} {Λ = Λ} n) f
IL⊗R₁~Γ {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Λ = Λ} (intrp D g h) f =
  g~ (IL⊗R₁ {Γ = Γ₀} {Δ = Γ₁ ++ D ∷ Λ})

IL⊗R₁~Δ : ∀ {Γ Δ₀ Δ₁ Ω Λ A B}
  → (n : MIP Γ (Δ₀ ++ Δ₁) [] A)
  → (m : MIP [] Ω Λ B)
  → IL~Δ' {Γ = Γ} {Δ₀ = Δ₀} {Δ₁ = Δ₁ ++ Ω} {Λ = Λ} (⊗R~' n m)
      ~ ⊗R~' (IL~Δ' {Γ = Γ} {Δ₀ = Δ₀} {Δ₁ = Δ₁} {Λ = []} n) m
IL⊗R₁~Δ {Γ = Γ} {Δ₀ = Δ₀} {Δ₁ = Δ₁} {Ω = Ω} (intrp D g h) (intrp E g' h') =
  h~ (IL⊗R₁ {Γ = Δ₀} {Δ = Δ₁} {Λ = Ω} {f = h} {g = h'})

IL⊗R₁~Λ : ∀ {Γ Δ Λ₀ Λ₁ Ω A B}
  → (n : MIP Γ Δ (Λ₀ ++ Λ₁) A)
  → (f : Ω ⊢ B)
  → IL~Λ' {Γ = Γ} {Δ = Δ} {Λ₀ = Λ₀} {Λ₁ = Λ₁ ++ Ω} (⊗R~₁' n f)
      ~ ⊗R~₁' (IL~Λ' {Γ = Γ} {Δ = Δ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} n) f
IL⊗R₁~Λ {Γ = Γ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} (intrp D g h) f =
  g~ (IL⊗R₁ {Γ = Γ ++ D ∷ Λ₀} {Δ = Λ₁})

IL⊗R₂~Γ : ∀ {Γ₀ Γ₁ Δ Λ Ω A B}
  → (n : MIP (Γ₀ ++ Γ₁) Δ Λ B)
  → (f : Ω ⊢ A)
  → IL~Γ' {Γ₀ = Ω ++ Γ₀} {Γ₁ = Γ₁} {Δ = Δ} {Λ = Λ} (⊗R~₂' n f)
      ~ ⊗R~₂' (IL~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ} {Λ = Λ} n) f
IL⊗R₂~Γ {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Λ = Λ} {Ω = Ω} (intrp D g h) f =
  g~ (IL⊗R₂ {Γ = Ω} {Δ = Γ₀} {Λ = Γ₁ ++ D ∷ Λ} {f = f} {g = g})

IL⊗R₂~Δ : ∀ {Γ Δ₀ Δ₁ Δ₂ Λ A B}
  → (n : MIP Γ Δ₀ [] A)
  → (m : MIP [] (Δ₁ ++ Δ₂) Λ B)
  → IL~Δ' {Γ = Γ} {Δ₀ = Δ₀ ++ Δ₁} {Δ₁ = Δ₂} {Λ = Λ} (⊗R~' n m)
      ~ ⊗R~' n (IL~Δ' {Γ = []} {Δ₀ = Δ₁} {Δ₁ = Δ₂} {Λ = Λ} m)
IL⊗R₂~Δ {Δ₀ = Δ₀} {Δ₁ = Δ₁} {Δ₂ = Δ₂} (intrp D g h) (intrp E g' h') =
  h~ (IL⊗R₂ {Γ = Δ₀} {Δ = Δ₁} {Λ = Δ₂} {f = h} {g = h'})

IL⊗R₂~Λ : ∀ {Γ Δ Λ₀ Λ₁ Ω A B}
  → (n : MIP Γ Δ (Λ₀ ++ Λ₁) B)
  → (f : Ω ⊢ A)
  → IL~Λ' {Γ = Ω ++ Γ} {Δ = Δ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} (⊗R~₂' n f)
      ~ ⊗R~₂' (IL~Λ' {Γ = Γ} {Δ = Δ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} n) f
IL⊗R₂~Λ {Γ = Γ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} {Ω = Ω} (intrp D g h) f =
  g~ (IL⊗R₂ {Γ = Ω} {Δ = Γ ++ D ∷ Λ₀} {Λ = Λ₁} {f = f} {g = g})

IL⊗R₁~Γ⊗R : ∀ {Γ₀ Γ₁ Δ₀ Δ₁ Λ A B}
  → (n : MIP (Γ₀ ++ Γ₁) Δ₀ [] A)
  → (m : MIP [] Δ₁ Λ B)
  → IL~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ₀ ++ Δ₁} {Λ = Λ} (⊗R~' n m)
      ~ ⊗R~' (IL~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ₀} {Λ = []} n) m
IL⊗R₁~Γ⊗R {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Λ = Λ} (intrp D g h) (intrp E g' h') =
  g~
    (IL⊗L-comm₁ {Γ = Γ₀} {Δ = Γ₁} {Λ = Λ} {f = ⊗R g g'}
    ∘ ⊗L {Γ = Γ₀ ++ I ∷ Γ₁} {Δ = Λ} {A = D} {B = E}
        (IL⊗R₁ {Γ = Γ₀} {Δ = Γ₁ ++ D ∷ []} {Λ = E ∷ Λ} {f = g} {g = g'}))

⊗L⊗R₁~Γ : ∀ {Γ₀ Γ₁ Δ Λ Ω A B A' B'}
  → (n : MIP (Γ₀ ++ A ∷ B ∷ Γ₁) Δ Λ A')
  → (f : Ω ⊢ B')
  → ⊗L~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ} {Λ = Λ ++ Ω} (⊗R~₁' n f)
      ~ ⊗R~₁' (⊗L~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ} {Λ = Λ} n) f
⊗L⊗R₁~Γ {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Λ = Λ} (intrp D g h) f =
  g~ (⊗L⊗R₁ {Γ = Γ₀} {Δ = Γ₁ ++ D ∷ Λ})

⊗L⊗R₁~Δ : ∀ {Γ Δ₀ Δ₁ Ω Λ A B A' B'}
  → (n : MIP Γ (Δ₀ ++ A ∷ B ∷ Δ₁) [] A')
  → (m : MIP [] Ω Λ B')
  → ⊗L~Δ' {Γ = Γ} {Δ₀ = Δ₀} {Δ₁ = Δ₁ ++ Ω} {Λ = Λ} (⊗R~' n m)
      ~ ⊗R~' (⊗L~Δ' {Γ = Γ} {Δ₀ = Δ₀} {Δ₁ = Δ₁} {Λ = []} n) m
⊗L⊗R₁~Δ {Δ₀ = Δ₀} {Δ₁ = Δ₁} {Ω = Ω} (intrp D g h) (intrp E g' h') =
  h~ (⊗L⊗R₁ {Γ = Δ₀} {Δ = Δ₁} {Λ = Ω} {f = h} {g = h'})

⊗L⊗R₁~Λ : ∀ {Γ Δ Λ₀ Λ₁ Ω A B A' B'}
  → (n : MIP Γ Δ (Λ₀ ++ A ∷ B ∷ Λ₁) A')
  → (f : Ω ⊢ B')
  → ⊗L~Λ' {Γ = Γ} {Δ = Δ} {Λ₀ = Λ₀} {Λ₁ = Λ₁ ++ Ω} (⊗R~₁' n f)
      ~ ⊗R~₁' (⊗L~Λ' {Γ = Γ} {Δ = Δ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} n) f
⊗L⊗R₁~Λ {Γ = Γ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} (intrp D g h) f =
  g~ (⊗L⊗R₁ {Γ = Γ ++ D ∷ Λ₀} {Δ = Λ₁})

⊗L⊗R₁~Γ⊗R : ∀ {Γ₀ Γ₁ Δ₀ Δ₁ Λ A B A' B'}
  → (n : MIP (Γ₀ ++ A ∷ B ∷ Γ₁) Δ₀ [] A')
  → (m : MIP [] Δ₁ Λ B')
  → ⊗L~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ₀ ++ Δ₁} {Λ = Λ} (⊗R~' n m)
      ~ ⊗R~' (⊗L~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ₀} {Λ = []} n) m
⊗L⊗R₁~Γ⊗R {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Λ = Λ} {A = A} {B = B} (intrp D g h) (intrp E g' h') =
  g~
    ((~ ⊗L⊗L)
    ∘ ⊗L {Γ = Γ₀ ++ A ⊗ B ∷ Γ₁} {Δ = Λ} {A = D} {B = E}
        (⊗L⊗R₁ {Γ = Γ₀} {Δ = Γ₁ ++ D ∷ []} {Λ = E ∷ Λ} {f = g} {g = g'}))

⊗L⊗R₂~Γ : ∀ {Γ₀ Γ₁ Δ Λ Ω A B A' B'}
  → (n : MIP (Γ₀ ++ A ∷ B ∷ Γ₁) Δ Λ B')
  → (f : Ω ⊢ A')
  → ⊗L~Γ' {Γ₀ = Ω ++ Γ₀} {Γ₁ = Γ₁} {Δ = Δ} {Λ = Λ} (⊗R~₂' n f)
      ~ ⊗R~₂' (⊗L~Γ' {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Δ = Δ} {Λ = Λ} n) f
⊗L⊗R₂~Γ {Γ₀ = Γ₀} {Γ₁ = Γ₁} {Λ = Λ} {Ω = Ω} (intrp D g h) f =
  g~ (⊗L⊗R₂ {Γ = Ω} {Δ = Γ₀} {Λ = Γ₁ ++ D ∷ Λ} {f = f} {g = g})

⊗L⊗R₂~Δ : ∀ {Γ Δ₀ Δ₁ Δ₂ Λ A B A' B'}
  → (n : MIP Γ Δ₀ [] A')
  → (m : MIP [] (Δ₁ ++ A ∷ B ∷ Δ₂) Λ B')
  → ⊗L~Δ' {Γ = Γ} {Δ₀ = Δ₀ ++ Δ₁} {Δ₁ = Δ₂} {Λ = Λ} (⊗R~' n m)
      ~ ⊗R~' n (⊗L~Δ' {Γ = []} {Δ₀ = Δ₁} {Δ₁ = Δ₂} {Λ = Λ} m)
⊗L⊗R₂~Δ {Δ₀ = Δ₀} {Δ₁ = Δ₁} {Δ₂ = Δ₂} (intrp D g h) (intrp E g' h') =
  h~ (⊗L⊗R₂ {Γ = Δ₀} {Δ = Δ₁} {Λ = Δ₂} {f = h} {g = h'})

⊗L⊗R₂~Λ : ∀ {Γ Δ Λ₀ Λ₁ Ω A B A' B'}
  → (n : MIP Γ Δ (Λ₀ ++ A ∷ B ∷ Λ₁) B')
  → (f : Ω ⊢ A')
  → ⊗L~Λ' {Γ = Ω ++ Γ} {Δ = Δ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} (⊗R~₂' n f)
      ~ ⊗R~₂' (⊗L~Λ' {Γ = Γ} {Δ = Δ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} n) f
⊗L⊗R₂~Λ {Γ = Γ} {Λ₀ = Λ₀} {Λ₁ = Λ₁} {Ω = Ω} (intrp D g h) f =
  g~ (⊗L⊗R₂ {Γ = Ω} {Δ = Γ ++ D ∷ Λ₀} {Λ = Λ₁} {f = f} {g = g})
