{-# OPTIONS --rewriting #-}

module IntrpWellDefCases.LeftImpLImpLComm where

open import IntrpWellDefCases.Base

mip≗⇐L⇒L-comm : ∀ Γ Δ Λ
  {Γ₁ Δ₀ Δ₁ Λ₁ Ξ : Cxt} {A B A' B' C : Fma}
  {f : Δ₀ ⊢ A} {f' : Δ₁ ⊢ A'} {g : Γ₁ ++ B ∷ Λ₁ ++ B' ∷ Ξ ⊢ C}
  → (eq : Γ₁ ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ ≡ Γ ++ Δ ++ Λ)
  → MIP≗ Γ Δ Λ C
        (mip Γ Δ Λ (⇐L {Γ₁} {Δ₀} {Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ} f (⇒L {Γ₁ ++ B ∷ Λ₁} {Δ₁} {Ξ} f' g)) eq)
        (mip Γ Δ Λ (⇒L {Γ₁ ++ B ⇐ A ∷ Δ₀ ++ Λ₁} {Δ₁} {Ξ} f' (⇐L {Γ₁} {Δ₀} {Λ₁ ++ B' ∷ Ξ} f g)) eq)
mip≗⇐L⇒L-comm Γ [] Λ eq = mip[]≗ Γ Λ eq ⇐L⇒L-comm
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq 
  with cases++ Γ₁ (Γ ++ E ∷ Δ) (Δ₀ ++ Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ) Λ
   (sym eq)
... | inj₁ (Ω' , eq1 , eq2) 
  with cases++ Γ₁ Γ Ω' (E ∷ Δ) eq1
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₁ (Ω'' , refl , refl) 
  with cases++ Ω'' Δ₀ (Δ ++ Λ) (Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ) eq2
... | inj₁ (Ω''' , refl , eq4) 
  with cases++ (Ω''' ++ Λ₁ ++ Δ₁) Δ Ξ Λ eq4
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Ω'') (E ∷ Δ) Λ {Γ₁} {.(Ω'' ++ E ∷ Ω''')} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} refl | inj₁ (.(Ω'' ++ E ∷ Δ) , refl , refl) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₁ (Ξ' , refl , refl) with Λ₁
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Ω'') (E ∷ Δ) Λ {Γ₁} {.(Ω'' ++ E ∷ Ω''')} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} refl | inj₁ (.(Ω'' ++ E ∷ Δ) , refl , refl) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₁ (Ξ' , refl , refl) | [] with Δ₁
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Ω'') (E ∷ Δ) Λ {Γ₁} {.(Ω'' ++ E ∷ Ω''')} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.(Ω'' ++ E ∷ Δ) , refl , refl) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₁ (Ξ' , refl , refl) | [] | []
  rewrite ++?-inj₁ (A' ⇒ B' ∷ Ξ') (Ω'' ++ E ∷ Ω''') Λ |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Ω'') Ω''' (A' ⇒ B' ∷ Ξ' ++ Λ) E |
          ++?-inj₁ (E ∷ Ω''') Ω'' (A' ⇒ B' ∷ Ξ') |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Ω'') Ω''' [] E |
          cases++-inj₁ Ω''' Ξ' Λ (A' ⇒ B') |
          cases++-inj₁ Γ₁ (Ω'' ++ E ∷ Ω''' ++ B' ∷ Ξ') Λ (B ⇐ A) |
          cases++-inj₁ Γ₁ Ω'' (E ∷ Ω''' ++ B' ∷ Ξ') (B ⇐ A) |
          ++?-inj₁ (B' ∷ Ξ') (Ω'' ++ E ∷ Ω''') Λ |
          ++?-inj₁ (E ∷ Ω''') Ω'' (B' ∷ Ξ') |
          ++?-inj₁ [] (Γ₁ ++ B ∷ []) (A' ⇒ B' ∷ Ξ' ++ Λ) =
  intrp≗
    (↝∷
      (⊗L {Γ = []} (⊗R ax
        (⇒L {Γ = []} {Δ = []} {Λ = []} {A = I}
          {B = mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.D} IR ax)) ,
        (((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
          ((⇐L⇒L-comm ∘ ((⇒L refl (~ (cutaxA-left
            ((Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ [])
            (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
              (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g))
            refl)))
          ∘ (~ (cut⇒L≗
            ((Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ [])
            (mip [] [] [] f' refl .MIP.h) ax
            (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
              (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g))
            refl))))
          ∘ ((~ (cutaxA-left (Γ₁ ++ B ⇐ A ∷ Ω'')
            (cut
              ((Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ [])
              (⇒L {Γ = []} {Δ = []} {Λ = []} {A = I}
                {B = mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.D} IR ax)
              (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g))
              refl)
            refl))
          ∘ (≡to≗ (cut⊗R⊗Lcases++ (Γ₁ ++ B ⇐ A ∷ Ω'') Λ
              {f = ax}
              {g = ⇒L {Γ = []} {Δ = []} {Λ = []} {A = I}
                {B = mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.D} IR ax}
              {h = ⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g)})))))
          ∘
          (~ (cut⊗L≗ (Γ₁ ++ B ⇐ A ∷ Ω'') [] []
          (⊗R ax
            (⇒L {Γ = []} {Δ = []} {Λ = []} {A = I}
              {B = mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.D} IR ax))
          (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
            (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
              (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g)))
          refl))) ,
         ~ ⇒L⊗R₂))
      refl)
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Ω'') (E ∷ Δ) Λ {Γ₁} {.(Ω'' ++ E ∷ Ω''')} {Δ₁₀} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.(Ω'' ++ E ∷ Δ) , refl , refl) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₁ (Ξ' , refl , refl) | [] | G ∷ Δ₁
  rewrite ++?-inj₁ (G ∷ Δ₁ ++ A' ⇒ B' ∷ Ξ') (Ω'' ++ E ∷ Ω''') Λ |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Ω'') (Ω''' ++ G ∷ Δ₁) (A' ⇒ B' ∷ Ξ' ++ Λ) E |
          ++?-inj₁ (E ∷ Ω''') Ω'' (G ∷ Δ₁ ++ A' ⇒ B' ∷ Ξ') |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Ω'') Ω''' (G ∷ Δ₁) E |
          cases++-inj₁ (Ω''' ++ G ∷ Δ₁) Ξ' Λ (A' ⇒ B') |
          cases++-inj₁ Γ₁ (Ω'' ++ E ∷ Ω''' ++ B' ∷ Ξ') Λ (B ⇐ A) |
          cases++-inj₁ Γ₁ Ω'' (E ∷ Ω''' ++ B' ∷ Ξ') (B ⇐ A) |
          ++?-inj₁ (B' ∷ Ξ') (Ω'' ++ E ∷ Ω''') Λ |
          ++?-inj₁ (E ∷ Ω''') Ω'' (B' ∷ Ξ') |
          ++?-inj₂ (Γ₁ ++ B ∷ []) Δ₁ (A' ⇒ B' ∷ Ξ' ++ Λ) G |
          cases++-inj₂ [] (Γ₁ ++ B ∷ []) Δ₁ G |
          cases++-inj₁ Δ₁ Ξ' Λ (A' ⇒ B') =
  intrp≗
    (↝∷
      (⊗L {Γ = []} (⊗R ax
        (⇒L {Γ = []} {Δ = []} {Λ = []} {A = I}
          {B = mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.D} IR ax)) ,
        (((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
          ((⇐L⇒L-comm ∘ ((⇒L refl (~ (cutaxA-left
            ((Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ [])
            (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
              (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g))
            refl)))
          ∘ (~ (cut⇒L≗
            ((Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ [])
            IR ax
            (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
              (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g))
            refl))))
          ∘ ((~ (cutaxA-left (Γ₁ ++ B ⇐ A ∷ Ω'')
            (cut
              ((Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ [])
              (⇒L {Γ = []} {Δ = []} {Λ = []} {A = I}
                {B = mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.D} IR ax)
              (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g))
              refl)
            refl))
          ∘ (≡to≗ (cut⊗R⊗Lcases++ (Γ₁ ++ B ⇐ A ∷ Ω'') Λ
              {f = ax}
              {g = ⇒L {Γ = []} {Δ = []} {Λ = []} {A = I}
                {B = mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.D} IR ax}
              {h = ⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g)})))))
          ∘
          (~ (cut⊗L≗ (Γ₁ ++ B ⇐ A ∷ Ω'') [] []
          (⊗R ax
            (⇒L {Γ = []} {Δ = []} {Λ = []} {A = I}
              {B = mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.D} IR ax))
          (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
            (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
              (mip (Γ₁ ++ B ∷ []) (B' ∷ Ξ') Λ g refl .MIP.g)))
          refl))) ,
         ~ ⇒L⊗R₂))
      refl)
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Ω'') (E ∷ Δ) Λ {Γ₁} {.(Ω'' ++ E ∷ Ω''')} {Δ₁} {Λ₁₀} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.(Ω'' ++ E ∷ Δ) , refl , refl) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₁ (Ξ' , refl , refl) | F ∷ Λ₁
  rewrite ++?-inj₁ (F ∷ Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ') (Ω'' ++ E ∷ Ω''') Λ |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Ω'') (Ω''' ++ F ∷ Λ₁ ++ Δ₁) (A' ⇒ B' ∷ Ξ' ++ Λ) E |
          ++?-inj₁ (E ∷ Ω''') Ω'' (F ∷ Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ') |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Ω'') (Ω''' ++ F ∷ Λ₁) Δ₁ E |
          cases++-inj₁ (Ω''' ++ F ∷ Λ₁ ++ Δ₁) Ξ' Λ (A' ⇒ B') |
          cases++-inj₁ Γ₁ (Ω'' ++ E ∷ Ω''' ++ F ∷ Λ₁ ++ B' ∷ Ξ') Λ (B ⇐ A) |
          cases++-inj₁ Γ₁ Ω'' (E ∷ Ω''' ++ F ∷ Λ₁ ++ B' ∷ Ξ') (B ⇐ A) |
          ++?-inj₁ (F ∷ Λ₁ ++ B' ∷ Ξ') (Ω'' ++ E ∷ Ω''') Λ |
          ++?-inj₁ (E ∷ Ω''') Ω'' (F ∷ Λ₁ ++ B' ∷ Ξ') |
          ++?-inj₂ (Γ₁ ++ B ∷ []) (Λ₁ ++ Δ₁) (A' ⇒ B' ∷ Ξ' ++ Λ) F |
          cases++-inj₁ (Γ₁ ++ B ∷ []) Λ₁ Δ₁ F |
          cases++-inj₁ (Λ₁ ++ Δ₁) Ξ' Λ (A' ⇒ B') = intrp≗ (↝∷ (ax , ((~ (cutaxA-left (Γ₁ ++ B ⇐ A ∷ Ω'')
            (⊗L {Γ₁ ++ B ⇐ A ∷ Ω''} (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
            (mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁ ++ B' ∷ Ξ') Λ g refl .MIP.g))) refl)) , ~ ⇒L⊗R₂)) refl)
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , eq4) | inj₂ (Ξ' , refl , eq6) 
  with ++? Δ Ω''' Ξ' (Λ₁ ++ Δ₁) eq6
... | inj₁ (Ξ'' , eq7 , refl) 
  with ++? Ξ'' Λ₁ Ξ' Δ₁ eq7
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Ω'') (E ∷ .(Ω''' ++ Ξ'')) .(Ξ' ++ A' ⇒ B' ∷ Ξ) {Γ₁} {.(Ω'' ++ E ∷ Ω''')} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.(Ω'' ++ E ∷ Ω''' ++ Ξ'') , refl , refl) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₂ (Ξ' , refl , refl) | inj₁ (Ξ'' , refl , refl) | inj₁ (Θ , refl , refl)
  rewrite ++?-inj₁ (Λ₁ ++ Θ) (Ω'' ++ E ∷ Ω''') (Ξ' ++ A' ⇒ B' ∷ Ξ) |
          ++?-inj₁ (E ∷ Ω''') Ω'' (Λ₁ ++ Θ) |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Ω'') (Ω''' ++ Λ₁ ++ Θ ++ Ξ') (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Ω'') (Ω''' ++ Λ₁) (Θ ++ Ξ') E |
          cases++-inj₂ Ξ' (Ω''' ++ Λ₁ ++ Θ) Ξ (A' ⇒ B') |
          ++?-inj₁ Θ (Ω''' ++ Λ₁) Ξ' |
          cases++-inj₁ Γ₁ (Ω'' ++ E ∷ Ω''' ++ Λ₁) (B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₁ Γ₁ Ω'' (E ∷ Ω''' ++ Λ₁) (B ⇐ A) |
          ++?-inj₁ Λ₁ (Ω'' ++ E ∷ Ω''') (B' ∷ Ξ) |
          ++?-inj₁ (E ∷ Ω''') Ω'' Λ₁
  with Λ₁
... | [] with Θ
... | [] =
      intrp≗
        (↝∷
          (⊗R ax IR ,
            ((((((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
                (⇐L refl
                  (IL⇒L-comm₁ {Γ = Γ₁ ++ B ∷ []} {Δ = Ξ'} {Λ = []} {Ω = Ξ})))
                ∘
                (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
                  (⇐L⇒L-comm
                    {Γ = Γ₁}
                    {Δ₀ = Ω'' ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
                    {Δ₁ = Ξ'} {Λ = I ∷ []} {Ξ = Ξ})))
                ∘
                (⊗L⇒L-comm₁
                  {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
                  {Δ = Ξ'} {Λ = []} {Ω = Ξ}))
                ∘
                (~ (≡to≗ (cut⇒L-cases++₁ []
                  ((Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗ I ∷ [])
                  {Λ = Ξ'} {Λ₁ = Ξ}
                  {f = IR}
                  {g = IL {Γ = []} {Δ = Ξ'} f'}
                  {h = ⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                    (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                      (IL {Γ = Γ₁ ++ B ∷ []} {Δ = B' ∷ Ξ} g))}))))
                ∘
                (~ (cutaxA-left (Γ₁ ++ B ⇐ A ∷ Ω'')
                  (cut ((Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗ I ∷ [])
                    IR
                    (⇒L
                      {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗ I ∷ []}
                      {Δ = I ∷ Ξ'} {Λ = Ξ}
                      (IL {Γ = []} {Δ = Ξ'} f')
                      (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                        (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                          (IL {Γ = Γ₁ ++ B ∷ []} {Δ = B' ∷ Ξ} g))))
                    refl)
                  refl)))
                ∘
                (≡to≗ (cut⊗R⊗Lcases++ (Γ₁ ++ B ⇐ A ∷ Ω'') (Ξ' ++ A' ⇒ B' ∷ Ξ)
                  {f = ax}
                  {g = IR}
                  {h = ⇒L
                    {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗ I ∷ []}
                    {Δ = I ∷ Ξ'} {Λ = Ξ}
                    (IL {Γ = []} {Δ = Ξ'} f')
                    (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                      (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                        (IL {Γ = Γ₁ ++ B ∷ []} {Δ = B' ∷ Ξ} g)))}))) ,
            refl)
          refl)
... | F ∷ Θ
  rewrite ++?-inj₂ (Γ₁ ++ B ∷ []) (Θ ++ Ξ') (A' ⇒ B' ∷ Ξ) F |
          cases++-inj₂ [] (Γ₁ ++ B ∷ []) (Θ ++ Ξ') F |
          cases++-inj₂ Ξ' Θ Ξ (A' ⇒ B') =
      intrp≗
        (↝∷
          (⊗L {Γ = []}
            (⊗R (⊗R ax IR) ax) ,
            ((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
              (⇐L⇒L-comm
                {Γ = Γ₁}
                {Δ₀ = Ω'' ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
                {Δ₁ = mip [] (F ∷ Θ) Ξ' f' refl .MIP.D ∷ Ξ'}
                {Λ = []} {Ξ = Ξ}))
            ∘
            ((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
              (⇒L refl
                ((((~ (cutaxA-left (Γ₁ ++ B ⇐ A ∷ Ω'')
                  (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g) g) refl))
                ∘
                (cut-cong₂ (Γ₁ ++ B ⇐ A ∷ Ω'') refl
                  ((⇐L {Γ = Γ₁} refl (~ (cutIRIL (Γ₁ ++ B ∷ []) (B' ∷ Ξ))))
                  ∘
                  (~ (≡to≗ (cut⇐L-cases++-comm₁ Γ₁
                    {Γ₁ = []}
                    {Δ = Ω'' ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
                    {Λ = B' ∷ Ξ}
                    {f = IR}
                    {g = mip Ω'' (E ∷ Ω''') [] f refl .MIP.g}
                    {h = IL {Γ = Γ₁ ++ B ∷ []} {Δ = B' ∷ Ξ} g}))))))
                ∘
                (≡to≗ (cut⊗R⊗Lcases++ (Γ₁ ++ B ⇐ A ∷ Ω'') (B' ∷ Ξ)
                  {f = ax}
                  {g = IR}
                  {h = ⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                    (IL {Γ = Γ₁ ++ B ∷ []} {Δ = B' ∷ Ξ} g)}))))))
            ∘
            ((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
              ((((~ (≡to≗ (cut⇒L-cases++-comm₂ (Γ₁ ++ B ⇐ A ∷ Ω'') []
                {f = ⊗R ax IR}
                {g = mip [] (F ∷ Θ) Ξ' f' refl .MIP.g}
                {h = ⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                  (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                    (IL {Γ = Γ₁ ++ B ∷ []} {Δ = B' ∷ Ξ} g))}))))
              ∘
              (cut-cong₂ (Γ₁ ++ B ⇐ A ∷ Ω'') refl
                (~ (cutaxA-left
                  ((Γ₁ ++ B ⇐ A ∷ Ω'') ++
                    mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗ I ∷ [])
                  (⇒L
                    {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++
                      mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗ I ∷ []}
                    {Δ = mip [] (F ∷ Θ) Ξ' f' refl .MIP.D ∷ Ξ'}
                    {Λ = Ξ}
                    (mip [] (F ∷ Θ) Ξ' f' refl .MIP.g)
                    (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                      (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                        (IL {Γ = Γ₁ ++ B ∷ []} {Δ = B' ∷ Ξ} g))))
                  refl))))
              ∘
              (≡to≗ (cut⊗R⊗Lcases++ (Γ₁ ++ B ⇐ A ∷ Ω'') (Ξ' ++ A' ⇒ B' ∷ Ξ)
                {f = ⊗R ax IR}
                {g = ax}
                {h = ⇒L
                  {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++
                    mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗ I ∷ []}
                  {Δ = mip [] (F ∷ Θ) Ξ' f' refl .MIP.D ∷ Ξ'}
                  {Λ = Ξ}
                  (mip [] (F ∷ Θ) Ξ' f' refl .MIP.g)
                  (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                    (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                      (IL {Γ = Γ₁ ++ B ∷ []} {Δ = B' ∷ Ξ} g)))}))))
            ∘
            (~ (cut⊗L≗ (Γ₁ ++ B ⇐ A ∷ Ω'') [] []
              (⊗R (⊗R ax IR) ax)
              (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = Ξ' ++ A' ⇒ B' ∷ Ξ}
                (⇒L
                  {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++
                    mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗ I ∷ []}
                  {Δ = mip [] (F ∷ Θ) Ξ' f' refl .MIP.D ∷ Ξ'}
                  {Λ = Ξ}
                  (mip [] (F ∷ Θ) Ξ' f' refl .MIP.g)
                  (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                    (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                      (IL {Γ = Γ₁ ++ B ∷ []} {Δ = B' ∷ Ξ} g)))))
              refl))))) ,
            refl)
          refl)
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Ω'') (E ∷ .(Ω''' ++ Ξ'')) .(Ξ' ++ A' ⇒ B' ∷ Ξ) {Γ₁} {.(Ω'' ++ E ∷ Ω''')} {Δ₁} {Λ₁₀} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.(Ω'' ++ E ∷ Ω''' ++ Ξ'') , refl , refl) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₂ (Ξ' , refl , refl) | inj₁ (Ξ'' , refl , refl) | inj₁ (Θ , refl , refl) | F ∷ Λ₁
  rewrite ++?-inj₂ (Γ₁ ++ B ∷ []) (Λ₁ ++ Θ ++ Ξ') (A' ⇒ B' ∷ Ξ) F |
          cases++-inj₁ (Γ₁ ++ B ∷ []) Λ₁ (Θ ++ Ξ') F |
          cases++-inj₂ Ξ' (Λ₁ ++ Θ) Ξ (A' ⇒ B') |
          ++?-inj₁ Θ Λ₁ Ξ' =
      intrp≗
        (↝∷
          (⊗L {Γ = []}
            (⊗L {Γ = mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
              (⊗R (⊗R ax ax) ax)) ,
            ((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
              (_∘_
                (_∘_
                  (~ (⊗L⇐L-comm₂ {Γ = Γ₁}
                    {Δ = Ω'' ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
                    {Λ = []}
                    {Ω = Ξ' ++ A' ⇒ B' ∷ Ξ}))
                  (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω'' ++
                    mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
                    (⇐L⇒L-comm {Γ = Γ₁}
                      {Δ₀ = Ω'' ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
                      {Δ₁ = mip [] Θ Ξ' f' refl .MIP.D ∷ Ξ'}
                      {Λ = mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.D ∷ []}
                      {Ξ = Ξ})))
                (_∘_
                  (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω'' ++
                    mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
                    (_∘_
                      (_∘_
                        (⇒L
                          {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++
                            mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷
                            mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.D ∷ []}
                          {Δ = mip [] Θ Ξ' f' refl .MIP.D ∷ Ξ'}
                          {Λ = Ξ}
                          refl
                          (_∘_
                            (~ (cutaxA-left
                              ((Γ₁ ++ B ⇐ A ∷ Ω'') ++
                               mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ [])
                              (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                                (mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.g))
                              refl))
                            (_∘_
                              (~ (cutaxA-left (Γ₁ ++ B ⇐ A ∷ Ω'')
                                (cut
                                  ((Γ₁ ++ B ⇐ A ∷ Ω'') ++
                                   mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ [])
                                  ax
                                  (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                                    (mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.g))
                                  refl)
                                refl))
                              (≡to≗ (cut⊗R⊗Lcases++ (Γ₁ ++ B ⇐ A ∷ Ω'') (B' ∷ Ξ)
                                {f = ax}
                                {g = ax}
                                {h = ⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                                  (mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.g)})))))
                        (~ (≡to≗ (cut⇒L-cases++-comm₂ (Γ₁ ++ B ⇐ A ∷ Ω'') []
                          {Δ = mip [] Θ Ξ' f' refl .MIP.D ∷ Ξ'}
                          {Λ₁ = Ξ}
                          {f = ⊗R ax ax}
                          {g = mip [] Θ Ξ' f' refl .MIP.g}
                          {h = (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                            (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                              (mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.g))) }))))
                      (_∘_
                        (~ (cut-cong₂ (Γ₁ ++ B ⇐ A ∷ Ω'') refl
                          (cutaxA-left
                            ((Γ₁ ++ B ⇐ A ∷ Ω'') ++
                             (mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗
                              mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.D) ∷ [])
                            (⇒L
                              {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++
                                (mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗
                                 mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.D) ∷ []}
                              {Δ = mip [] Θ Ξ' f' refl .MIP.D ∷ Ξ'}
                              {Λ = Ξ}
                              (mip [] Θ Ξ' f' refl .MIP.g)
                              (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                                (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                                  (mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.g))))
                            refl)))
                        (≡to≗ (cut⊗R⊗Lcases++ (Γ₁ ++ B ⇐ A ∷ Ω'')
                          (Ξ' ++ A' ⇒ B' ∷ Ξ)
                          {f = ⊗R ax ax}
                          {g = ax}
                          {h = ⇒L
                            {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++
                              (mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗
                               mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.D) ∷ []}
                            {Δ = mip [] Θ Ξ' f' refl .MIP.D ∷ Ξ'}
                            {Λ = Ξ}
                            (mip [] Θ Ξ' f' refl .MIP.g)
                            (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                              (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                                (mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.g)))})))))
                  (~ (cut⊗L≗ (Γ₁ ++ B ⇐ A ∷ Ω'')
                    (mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []) []
                    (⊗R (⊗R ax ax) ax)
                    (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = Ξ' ++ A' ⇒ B' ∷ Ξ}
                      (⇒L
                        {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++
                          (mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗
                           mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.D) ∷ []}
                        {Δ = mip [] Θ Ξ' f' refl .MIP.D ∷ Ξ'}
                        {Λ = Ξ}
                        (mip [] Θ Ξ' f' refl .MIP.g)
                        (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                          (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                            (mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.g)))))
                    refl)))))
            ∘
            (~ (cut⊗L≗ (Γ₁ ++ B ⇐ A ∷ Ω'') [] []
              {A = mip Ω'' (E ∷ Ω''') [] f refl .MIP.D}
              {B = mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.D ⊗
                   mip [] Θ Ξ' f' refl .MIP.D}
              (⊗L {Γ = mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
                (⊗R (⊗R ax ax) ax))
              (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = Ξ' ++ A' ⇒ B' ∷ Ξ}
                (⇒L
                  {Γ = (Γ₁ ++ B ⇐ A ∷ Ω'') ++
                    (mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ⊗
                     mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.D) ∷ []}
                  {Δ = mip [] Θ Ξ' f' refl .MIP.D ∷ Ξ'}
                  {Λ = Ξ}
                  (mip [] Θ Ξ' f' refl .MIP.g)
                  (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''} {Δ = B' ∷ Ξ}
                    (⇐L (mip Ω'' (E ∷ Ω''') [] f refl .MIP.g)
                      (mip (Γ₁ ++ B ∷ []) (F ∷ Λ₁) (B' ∷ Ξ) g refl .MIP.g)))))
              refl))) ,
            refl)
          refl)
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Ω'') (E ∷ .(Ω''' ++ Ξ'')) .(Ξ' ++ A' ⇒ B' ∷ Ξ) {Γ₁} {.(Ω'' ++ E ∷ Ω''')} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.(Ω'' ++ E ∷ Ω''' ++ Ξ'') , refl , refl) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₂ (Ξ' , refl , refl) | inj₁ (Ξ'' , refl , refl) | inj₂ (F , Θ , refl , refl)
  rewrite ++?-inj₁ Ξ'' (Ω'' ++ E ∷ Ω''') (F ∷ Θ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ) |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Ω'') (Ω''' ++ Ξ'' ++ F ∷ Θ ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          ++?-inj₁ (E ∷ Ω''') Ω'' Ξ'' |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Ω'') (Ω''' ++ Ξ'' ++ F ∷ Θ) Δ₁ E |
          cases++-inj₂ (F ∷ Θ ++ Δ₁) (Ω''' ++ Ξ'') Ξ (A' ⇒ B') |
          ++?-inj₂ (Ω''' ++ Ξ'') Θ Δ₁ F |
          cases++-inj₁ Γ₁ (Ω'' ++ E ∷ Ω''' ++ Ξ'') (F ∷ Θ ++ B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₁ Γ₁ Ω'' (E ∷ Ω''' ++ Ξ'') (B ⇐ A) |
          ++?-inj₁ Ξ'' (Ω'' ++ E ∷ Ω''') (F ∷ Θ ++ B' ∷ Ξ) |
          ++?-inj₁ (E ∷ Ω''') Ω'' Ξ'' =
    intrp≗
      (~-trans
        (⇐L~⊗ refl
          (mip⇒L~Λ∷ (Γ₁ ++ B ∷ []) Ξ'' F Θ Ξ {Ω = Δ₁}))
        (g~
          ((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
            (⇐L⇒L-comm
              {Γ = Γ₁}
              {Δ₀ = Ω'' ++ mip Ω'' (E ∷ Ω''') [] f refl .MIP.D ∷ []}
              {Δ₁ = Δ₁}
              {Λ = mip (Γ₁ ++ B ∷ []) Ξ'' (F ∷ Θ ++ B' ∷ Ξ) g refl .MIP.D ∷ F ∷ Θ}
              {Ξ = Ξ}))
          ∘
          ⊗L⇒L-comm₁
            {Γ = Γ₁ ++ B ⇐ A ∷ Ω''}
            {Δ = Δ₁}
            {Λ = F ∷ Θ}
            {Ω = Ξ})))
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Ω'') (E ∷ Δ) .(Ξ' ++ A' ⇒ B' ∷ Ξ) {Γ₁} {.(Ω'' ++ E ∷ Ω''')} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} refl | inj₁ (.(Ω'' ++ E ∷ Δ) , refl , refl) | inj₁ (Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₂ (Ξ' , refl , refl) | inj₂ (F , Ξ'' , refl , refl)
  rewrite ++?-inj₂ (Ω'' ++ E ∷ Δ) Ξ'' (Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ) F |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Ω'') (Δ ++ F ∷ Ξ'' ++ Λ₁ ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Ω'') (Δ ++ F ∷ Ξ'' ++ Λ₁) Δ₁ E |
          cases++-inj₂ (F ∷ Ξ'' ++ Λ₁ ++ Δ₁) Δ Ξ (A' ⇒ B') |
          ++?-inj₂ Δ (Ξ'' ++ Λ₁) Δ₁ F |
          cases++-inj₁ Γ₁ (Ω'' ++ E ∷ Δ) (F ∷ Ξ'' ++ Λ₁ ++ B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₁ Γ₁ Ω'' (E ∷ Δ) (B ⇐ A) |
          ++?-inj₂ (Ω'' ++ E ∷ Δ) Ξ'' (Λ₁ ++ B' ∷ Ξ) F =
  intrp≗ (g~ ⇐L⇒L-comm)
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₁ (Ω'' , refl , refl) | inj₂ (Ω''' , eq3 , refl) 
  with cases++ Ω''' Λ₁ (Δ ++ Λ) (Δ₁ ++ A' ⇒ B' ∷ Ξ) eq3
... | inj₁ (Ξ' , refl , eq5) 
  with cases++ (Ξ' ++ Δ₁) Δ Ξ Λ eq5
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Δ₀ ++ Ω''') (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {.(Ω''' ++ E ∷ Ξ')} {Ξ} {A} {B} {A'} {B'} refl | inj₁ (.((Δ₀ ++ Ω''') ++ E ∷ Δ) , refl , refl) | inj₁ (.(Δ₀ ++ Ω''') , refl , refl) | inj₂ (Ω''' , refl , refl) | inj₁ (Ξ' , refl , refl) | inj₁ (Ξ'' , refl , refl)
  rewrite ++?-inj₁ (Ω''' ++ E ∷ Ξ' ++ Δ₁ ++ A' ⇒ B' ∷ Ξ'') Δ₀ Λ |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ Ω''') (Ξ' ++ Δ₁) (A' ⇒ B' ∷ Ξ'' ++ Λ) E |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ Ω''') Ξ' Δ₁ E |
          cases++-inj₁ (Ξ' ++ Δ₁) Ξ'' Λ (A' ⇒ B') |
          cases++-inj₁ Γ₁ (Δ₀ ++ Ω''' ++ E ∷ Ξ' ++ B' ∷ Ξ'') Λ (B ⇐ A)
  with Ω'''
... | []
  rewrite ++?-inj₁ [] Δ₀ (E ∷ Ξ' ++ Δ₁ ++ A' ⇒ B' ∷ Ξ'') |
          cases++-inj₁ Γ₁ Δ₀ (E ∷ Ξ' ++ B' ∷ Ξ'') (B ⇐ A) |
          ++?-inj₂ (Γ₁ ++ B ∷ []) (Ξ' ++ Δ₁) (A' ⇒ B' ∷ Ξ'' ++ Λ) E |
          ++?-inj₁ (E ∷ Ξ' ++ B' ∷ Ξ'') Δ₀ Λ |
          cases++-inj₁ (Γ₁ ++ B ∷ []) Ξ' Δ₁ E |
          ++?-inj₁ [] Δ₀ (E ∷ Ξ' ++ B' ∷ Ξ'') |
          cases++-inj₁ (Ξ' ++ Δ₁) Ξ'' Λ (A' ⇒ B') =
  intrp≗ (h~ (~ ⇒L⊗R₂))
... | H ∷ Ω''''
  rewrite ++?-inj₂ Δ₀ Ω'''' (E ∷ Ξ' ++ Δ₁ ++ A' ⇒ B' ∷ Ξ'') H |
          cases++-inj₁ Γ₁ (Δ₀ ++ H ∷ Ω'''') (E ∷ Ξ' ++ B' ∷ Ξ'') (B ⇐ A) |
          ++?-inj₂ (Γ₁ ++ B ∷ H ∷ Ω'''') (Ξ' ++ Δ₁) (A' ⇒ B' ∷ Ξ'' ++ Λ) E |
          ++?-inj₁ (H ∷ Ω'''' ++ E ∷ Ξ' ++ B' ∷ Ξ'') Δ₀ Λ |
          cases++-inj₁ (Γ₁ ++ B ∷ H ∷ Ω'''') Ξ' Δ₁ E |
          ++?-inj₂ Δ₀ Ω'''' (E ∷ Ξ' ++ B' ∷ Ξ'') H |
          cases++-inj₁ (Ξ' ++ Δ₁) Ξ'' Λ (A' ⇒ B') =
  intrp≗ refl
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₁ (Ω'' , refl , refl) | inj₂ ([] , eq3 , refl) | inj₁ (Ξ' , refl , eq5) | inj₂ (Ξ'' , refl , eq7)
  with ++? Δ Ξ' Ξ'' Δ₁ eq7
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Δ₀ ++ []) (E ∷ .(Ξ' ++ Θ)) .(Ξ'' ++ A' ⇒ B' ∷ Ξ) {Γ₁} {Δ₀} {.(Θ ++ Ξ'')} {.(E ∷ Ξ')} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.((Δ₀ ++ []) ++ E ∷ Ξ' ++ Θ) , refl , refl) | inj₁ (.(Δ₀ ++ []) , refl , refl) | inj₂ ([] , refl , refl) | inj₁ (Ξ' , refl , refl) | inj₂ (Ξ'' , refl , refl) | inj₁ (Θ , refl , refl)
  rewrite ++?-inj₁ (E ∷ Ξ' ++ Θ) Δ₀ (Ξ'' ++ A' ⇒ B' ∷ Ξ) |
          ++?-inj₁ [] Δ₀ (E ∷ Ξ' ++ Θ) |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀) (Ξ' ++ Θ ++ Ξ'') (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Δ₀) Ξ' (Θ ++ Ξ'') E |
          cases++-inj₂ Ξ'' (Ξ' ++ Θ) Ξ (A' ⇒ B') |
          ++?-inj₁ Θ Ξ' Ξ'' |
          ++?-inj₂ (Γ₁ ++ B ∷ []) (Ξ' ++ Θ ++ Ξ'') (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ∷ []) Ξ' (Θ ++ Ξ'') E |
          cases++-inj₂ Ξ'' (Ξ' ++ Θ) Ξ (A' ⇒ B') |
          ++?-inj₁ Θ Ξ' Ξ'' |
          cases++-inj₁ Γ₁ (Δ₀ ++ E ∷ Ξ') (B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₁ Γ₁ Δ₀ (E ∷ Ξ') (B ⇐ A) |
          ++?-inj₁ (E ∷ Ξ') Δ₀ (B' ∷ Ξ) |
          ++?-inj₁ [] Δ₀ (E ∷ Ξ') =
  intrp≗
    (↝∷
      (⊗L {[]} (⊗L {I ∷ []} (⊗R (⊗R ax ax) ax)) ,
        ((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀}
          (_∘_
            (_∘_
              (~ (⊗L⇐L-comm₂ {Γ = Γ₁}
                {Δ = Δ₀ ++ I ∷ []}
                {Λ = []}
                {Ω = Ξ'' ++ A' ⇒ B' ∷ Ξ}))
              (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀ ++ I ∷ []}
                (⇐L⇒L-comm {Γ = Γ₁}
                  {Δ₀ = Δ₀ ++ I ∷ []}
                  {Δ₁ = mip [] Θ Ξ'' f' refl .MIP.D ∷ Ξ''}
                  {Λ = mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.D ∷ []}
                  {Ξ = Ξ})))
            (_∘_
              (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀ ++ I ∷ []}
                (_∘_
                  (_∘_
                    (⇒L
                      {Γ = (Γ₁ ++ B ⇐ A ∷ Δ₀) ++
                        I ∷ mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.D ∷ []}
                      {Δ = mip [] Θ Ξ'' f' refl .MIP.D ∷ Ξ''}
                      {Λ = Ξ}
                      refl
                      (_∘_
                        (~ (cutaxA-left
                          ((Γ₁ ++ B ⇐ A ∷ Δ₀) ++ I ∷ [])
                          (⇐L (IL {Γ = Δ₀} {Δ = []} f)
                            (mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.g))
                          refl))
                        (_∘_
                          (~ (cutaxA-left (Γ₁ ++ B ⇐ A ∷ Δ₀)
                            (cut
                              ((Γ₁ ++ B ⇐ A ∷ Δ₀) ++ I ∷ [])
                              ax
                              (⇐L (IL {Γ = Δ₀} {Δ = []} f)
                                (mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.g))
                              refl)
                            refl))
                          (≡to≗ (cut⊗R⊗Lcases++ (Γ₁ ++ B ⇐ A ∷ Δ₀) (B' ∷ Ξ)
                            {f = ax}
                            {g = ax}
                            {h = ⇐L (IL {Γ = Δ₀} {Δ = []} f)
                              (mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.g)})))))
                    (~ (≡to≗ (cut⇒L-cases++-comm₂ (Γ₁ ++ B ⇐ A ∷ Δ₀) []
                      {Δ = mip [] Θ Ξ'' f' refl .MIP.D ∷ Ξ''}
                      {Λ₁ = Ξ}
                      {f = ⊗R ax ax}
                      {g = mip [] Θ Ξ'' f' refl .MIP.g}
                      {h = ⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀} {Δ = B' ∷ Ξ}
                        (⇐L (IL {Γ = Δ₀} {Δ = []} f)
                          (mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.g))}))))
                  (_∘_
                    (~ (cut-cong₂ (Γ₁ ++ B ⇐ A ∷ Δ₀) refl
                      (cutaxA-left
                        ((Γ₁ ++ B ⇐ A ∷ Δ₀) ++
                         (I ⊗ mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.D) ∷ [])
                        (⇒L
                          {Γ = (Γ₁ ++ B ⇐ A ∷ Δ₀) ++
                            (I ⊗ mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.D) ∷ []}
                          {Δ = mip [] Θ Ξ'' f' refl .MIP.D ∷ Ξ''}
                          {Λ = Ξ}
                          (mip [] Θ Ξ'' f' refl .MIP.g)
                          (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀} {Δ = B' ∷ Ξ}
                            (⇐L (IL {Γ = Δ₀} {Δ = []} f)
                              (mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.g))))
                        refl)))
                    (≡to≗ (cut⊗R⊗Lcases++ (Γ₁ ++ B ⇐ A ∷ Δ₀)
                      (Ξ'' ++ A' ⇒ B' ∷ Ξ)
                      {f = ⊗R ax ax}
                      {g = ax}
                      {h = ⇒L
                        {Γ = (Γ₁ ++ B ⇐ A ∷ Δ₀) ++
                          (I ⊗ mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.D) ∷ []}
                        {Δ = mip [] Θ Ξ'' f' refl .MIP.D ∷ Ξ''}
                        {Λ = Ξ}
                        (mip [] Θ Ξ'' f' refl .MIP.g)
                        (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀} {Δ = B' ∷ Ξ}
                          (⇐L (IL {Γ = Δ₀} {Δ = []} f)
                            (mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.g)))})))))
              (~ (cut⊗L≗ (Γ₁ ++ B ⇐ A ∷ Δ₀)
                (I ∷ []) []
                (⊗R (⊗R ax ax) ax)
                (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀} {Δ = Ξ'' ++ A' ⇒ B' ∷ Ξ}
                  (⇒L
                    {Γ = (Γ₁ ++ B ⇐ A ∷ Δ₀) ++
                      (I ⊗ mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.D) ∷ []}
                    {Δ = mip [] Θ Ξ'' f' refl .MIP.D ∷ Ξ''}
                    {Λ = Ξ}
                    (mip [] Θ Ξ'' f' refl .MIP.g)
                    (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀} {Δ = B' ∷ Ξ}
                      (⇐L (IL {Γ = Δ₀} {Δ = []} f)
                        (mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.g)))))
                refl)))))
        ∘
        (~ (cut⊗L≗ (Γ₁ ++ B ⇐ A ∷ Δ₀) [] []
          {A = I}
          {B = mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.D ⊗
               mip [] Θ Ξ'' f' refl .MIP.D}
          (⊗L {Γ = I ∷ []} (⊗R (⊗R ax ax) ax))
          (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀} {Δ = Ξ'' ++ A' ⇒ B' ∷ Ξ}
            (⇒L
              {Γ = (Γ₁ ++ B ⇐ A ∷ Δ₀) ++
                (I ⊗ mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.D) ∷ []}
              {Δ = mip [] Θ Ξ'' f' refl .MIP.D ∷ Ξ''}
              {Λ = Ξ}
              (mip [] Θ Ξ'' f' refl .MIP.g)
              (⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀} {Δ = B' ∷ Ξ}
                (⇐L (IL {Γ = Δ₀} {Δ = []} f)
                  (mip (Γ₁ ++ B ∷ []) (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.g)))))
          refl))) ,
        refl)
      refl)
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Δ₀ ++ []) (E ∷ Δ) .(Ξ'' ++ A' ⇒ B' ∷ Ξ) {Γ₁} {Δ₀} {Δ₁} {.(E ∷ Ξ')} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.((Δ₀ ++ []) ++ E ∷ Δ) , refl , refl) | inj₁ (.(Δ₀ ++ []) , refl , refl) | inj₂ ([] , refl , refl) | inj₁ (Ξ' , refl , refl) | inj₂ (Ξ'' , refl , refl) | inj₂ (F , Θ , refl , refl)
  rewrite ++?-inj₁ (E ∷ Δ) Δ₀ (F ∷ Θ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ) |
          ++?-inj₁ [] Δ₀ (E ∷ Δ) |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀) (Δ ++ F ∷ Θ ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Δ₀) (Δ ++ F ∷ Θ) Δ₁ E |
          cases++-inj₂ (F ∷ Θ ++ Δ₁) Δ Ξ (A' ⇒ B') |
          ++?-inj₂ Δ Θ Δ₁ F |
          ++?-inj₂ (Γ₁ ++ B ∷ []) (Δ ++ F ∷ Θ ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ∷ []) (Δ ++ F ∷ Θ) Δ₁ E |
          cases++-inj₂ (F ∷ Θ ++ Δ₁) Δ Ξ (A' ⇒ B') |
          ++?-inj₂ Δ Θ Δ₁ F |
          cases++-inj₁ Γ₁ (Δ₀ ++ E ∷ Δ) (F ∷ Θ ++ B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₁ Γ₁ Δ₀ (E ∷ Δ) (B ⇐ A) |
          ++?-inj₁ (E ∷ Δ) Δ₀ (F ∷ Θ ++ B' ∷ Ξ) |
          ++?-inj₁ [] Δ₀ (E ∷ Δ) =
  intrp≗
    (g~
      ((⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀}
        (⇐L⇒L-comm
          {Γ = Γ₁}
          {Δ₀ = Δ₀ ++ I ∷ []}
          {Δ₁ = Δ₁}
          {Λ = mip (Γ₁ ++ B ∷ []) (E ∷ Δ) (F ∷ Θ ++ B' ∷ Ξ) g refl .MIP.D ∷ F ∷ Θ}
          {Ξ = Ξ}))
      ∘
      ⊗L⇒L-comm₁
        {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀}
        {Δ = Δ₁}
        {Λ = F ∷ Θ}
        {Ω = Ξ}))
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₁ (Ω'' , refl , refl) | inj₂ (x ∷ Ω'''' , eq3 , refl) | inj₁ (Ξ' , refl , eq5) | inj₂ (Ξ'' , refl , eq7)
  with ++? Δ Ξ' Ξ'' Δ₁ eq7
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Δ₀ ++ x ∷ Ω'''') (E ∷ .(Ξ' ++ Θ)) .(Ξ'' ++ A' ⇒ B' ∷ Ξ) {Γ₁} {Δ₀} {.(Θ ++ Ξ'')} {.((x ∷ Ω'''') ++ E ∷ Ξ')} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.((Δ₀ ++ x ∷ Ω'''') ++ E ∷ Ξ' ++ Θ) , refl , refl) | inj₁ (.(Δ₀ ++ x ∷ Ω'''') , refl , refl) | inj₂ (x ∷ Ω'''' , refl , refl) | inj₁ (Ξ' , refl , refl) | inj₂ (Ξ'' , refl , refl) | inj₁ (Θ , refl , refl)
  rewrite ++?-inj₁ (x ∷ Ω'''' ++ E ∷ Ξ' ++ Θ) Δ₀ (Ξ'' ++ A' ⇒ B' ∷ Ξ) |
          ++?-inj₂ Δ₀ Ω'''' (E ∷ Ξ' ++ Θ) x |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ x ∷ Ω'''') (Ξ' ++ Θ ++ Ξ'') (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ x ∷ Ω'''') Ξ' (Θ ++ Ξ'') E |
          cases++-inj₂ Ξ'' (Ξ' ++ Θ) Ξ (A' ⇒ B') |
          ++?-inj₁ Θ Ξ' Ξ'' |
          ++?-inj₂ (Γ₁ ++ B ∷ x ∷ Ω'''') (Ξ' ++ Θ ++ Ξ'') (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ∷ x ∷ Ω'''') Ξ' (Θ ++ Ξ'') E |
          cases++-inj₂ Ξ'' (Ξ' ++ Θ) Ξ (A' ⇒ B') |
          ++?-inj₁ Θ Ξ' Ξ'' |
          cases++-inj₁ Γ₁ (Δ₀ ++ x ∷ Ω'''' ++ E ∷ Ξ') (B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₁ Γ₁ (Δ₀ ++ x ∷ Ω'''') (E ∷ Ξ') (B ⇐ A) |
          ++?-inj₁ (x ∷ Ω'''' ++ E ∷ Ξ') Δ₀ (B' ∷ Ξ) |
          ++?-inj₂ Δ₀ Ω'''' (E ∷ Ξ') x =
  intrp≗
    (g~
      ((~ (⊗L⇐L-comm₂
        {Γ = Γ₁}
        {Δ = Δ₀}
        {Λ = x ∷ Ω''''}
        {Ω = Ξ'' ++ A' ⇒ B' ∷ Ξ}))
      ∘
      ⊗L {Γ = Γ₁ ++ B ⇐ A ∷ Δ₀ ++ x ∷ Ω''''}
        (⇐L⇒L-comm
          {Γ = Γ₁}
          {Δ₀ = Δ₀}
          {Δ₁ = mip [] Θ Ξ'' f' refl .MIP.D ∷ Ξ''}
          {Λ = x ∷ Ω'''' ++
            mip (Γ₁ ++ B ∷ x ∷ Ω'''') (E ∷ Ξ') (B' ∷ Ξ) g refl .MIP.D ∷ []}
          {Ξ = Ξ})))
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Δ₀ ++ x ∷ Ω'''') (E ∷ Δ) .(Ξ'' ++ A' ⇒ B' ∷ Ξ) {Γ₁} {Δ₀} {Δ₁} {.((x ∷ Ω'''') ++ E ∷ Ξ')} {Ξ} {A} {B} {A'} {B'} refl | inj₁ (.((Δ₀ ++ x ∷ Ω'''') ++ E ∷ Δ) , refl , refl) | inj₁ (.(Δ₀ ++ x ∷ Ω'''') , refl , refl) | inj₂ (x ∷ Ω'''' , refl , refl) | inj₁ (Ξ' , refl , refl) | inj₂ (Ξ'' , refl , refl) | inj₂ (F , Θ , refl , refl)
  rewrite ++?-inj₁ (x ∷ Ω'''' ++ E ∷ Δ) Δ₀ (F ∷ Θ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ) |
          ++?-inj₂ Δ₀ Ω'''' (E ∷ Δ) x |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ x ∷ Ω'''') (Δ ++ F ∷ Θ ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ x ∷ Ω'''') (Δ ++ F ∷ Θ) Δ₁ E |
          cases++-inj₂ (F ∷ Θ ++ Δ₁) Δ Ξ (A' ⇒ B') |
          ++?-inj₂ Δ Θ Δ₁ F |
          ++?-inj₂ (Γ₁ ++ B ∷ x ∷ Ω'''') (Δ ++ F ∷ Θ ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ (Γ₁ ++ B ∷ x ∷ Ω'''') (Δ ++ F ∷ Θ) Δ₁ E |
          cases++-inj₂ (F ∷ Θ ++ Δ₁) Δ Ξ (A' ⇒ B') |
          ++?-inj₂ Δ Θ Δ₁ F |
          cases++-inj₁ Γ₁ (Δ₀ ++ x ∷ Ω'''' ++ E ∷ Δ) (F ∷ Θ ++ B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₁ Γ₁ (Δ₀ ++ x ∷ Ω'''') (E ∷ Δ) (B ⇐ A) |
          ++?-inj₁ (x ∷ Ω'''' ++ E ∷ Δ) Δ₀ (F ∷ Θ ++ B' ∷ Ξ) |
          ++?-inj₂ Δ₀ Ω'''' (E ∷ Δ) x =
  intrp≗ (g~ ⇐L⇒L-comm)
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₁ (Ω'' , refl , refl) | inj₂ (Ω''' , eq3 , refl) | inj₂ (Ξ' , eq4 , refl) 
  with cases++ Δ₁ Ξ' Ξ (E ∷ Δ ++ Λ) (sym eq4)
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Ξ') (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} refl | inj₁ (.((Δ₀ ++ Λ₁ ++ Ξ') ++ E ∷ Δ) , refl , refl) | inj₁ (.(Δ₀ ++ Λ₁ ++ Ξ') , refl , refl) | inj₂ (.(Λ₁ ++ Ξ') , refl , refl) | inj₂ (Ξ' , refl , refl) | inj₁ (Ξ'' , refl , refl)
  with Λ₁
... | F ∷ Λ₂
  rewrite ++?-inj₁ (F ∷ Λ₂ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ'' ++ E ∷ Δ) Δ₀ Λ |
          ++?-inj₁ (A' ⇒ B' ∷ Ξ'') (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ F ∷ Λ₂ ++ Δ₁) (E ∷ Δ ++ Λ) |
          ++?-inj₂ Δ₀ (Λ₂ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ'') (E ∷ Δ) F |
          cases++-inj₁ Γ₁ (Δ₀ ++ F ∷ Λ₂ ++ B' ∷ Ξ'' ++ E ∷ Δ) Λ (B ⇐ A) |
          ++?-inj₁ (A' ⇒ B' ∷ Ξ'') (Γ₁ ++ B ∷ F ∷ Λ₂ ++ Δ₁) (E ∷ Δ ++ Λ) |
          cases++-inj₁ Γ₁ (Δ₀ ++ F ∷ Λ₂ ++ B' ∷ Ξ'') (E ∷ Δ) (B ⇐ A) |
          ++?-inj₁ (F ∷ Λ₂ ++ B' ∷ Ξ'' ++ E ∷ Δ) Δ₀ Λ |
          ++?-inj₂ Δ₀ (Λ₂ ++ B' ∷ Ξ'') (E ∷ Δ) F =
  intrp≗ (g~ ⇐L⇒L-comm)
... | [] with Δ₁
... | []
  rewrite ++?-inj₁ (A' ⇒ B' ∷ Ξ'' ++ E ∷ Δ) Δ₀ Λ |
          ++?-inj₁ (A' ⇒ B' ∷ Ξ'') (Γ₁ ++ B ⇐ A ∷ Δ₀) (E ∷ Δ ++ Λ) |
          ++?-inj₂ Δ₀ Ξ'' (E ∷ Δ) (A' ⇒ B') |
          cases++-inj₁ Γ₁ (Δ₀ ++ B' ∷ Ξ'' ++ E ∷ Δ) Λ (B ⇐ A) |
          ++?-inj₁ (A' ⇒ B' ∷ Ξ'') (Γ₁ ++ B ∷ []) (E ∷ Δ ++ Λ) |
          cases++-inj₁ Γ₁ (Δ₀ ++ B' ∷ Ξ'') (E ∷ Δ) (B ⇐ A) |
          ++?-inj₁ (B' ∷ Ξ'' ++ E ∷ Δ) Δ₀ Λ |
          ++?-inj₂ Δ₀ Ξ'' (E ∷ Δ) B' =
  intrp≗ (g~ ⇐L⇒L-comm)
... | G ∷ Δ₂
  rewrite ++?-inj₁ (G ∷ Δ₂ ++ A' ⇒ B' ∷ Ξ'' ++ E ∷ Δ) Δ₀ Λ |
          ++?-inj₁ (A' ⇒ B' ∷ Ξ'') (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ G ∷ Δ₂) (E ∷ Δ ++ Λ) |
          ++?-inj₂ Δ₀ (Δ₂ ++ A' ⇒ B' ∷ Ξ'') (E ∷ Δ) G |
          ++?-inj₁ (A' ⇒ B' ∷ Ξ'') (Γ₁ ++ B ∷ G ∷ Δ₂) (E ∷ Δ ++ Λ) |
          cases++-inj₁ Γ₁ (Δ₀ ++ B' ∷ Ξ'' ++ E ∷ Δ) Λ (B ⇐ A) |
          cases++-inj₁ Γ₁ (Δ₀ ++ B' ∷ Ξ'') (E ∷ Δ) (B ⇐ A) |
          ++?-inj₁ (B' ∷ Ξ'' ++ E ∷ Δ) Δ₀ Λ |
          ++?-inj₂ Δ₀ Ξ'' (E ∷ Δ) B' =
  intrp≗ (g~ ⇐L⇒L-comm)
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₁ (Ω'' , refl , refl) | inj₂ (Ω''' , eq3 , refl) | inj₂ (Ξ' , eq4 , refl)  | inj₂ (Ξ'' , eq5 , refl) 
  with cases++ Ξ'' (E ∷ Δ) Ξ Λ eq5
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Ξ') (E ∷ Δ) Λ {Γ₁} {Δ₀} {.(Ξ' ++ [])} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.((Δ₀ ++ Λ₁ ++ Ξ') ++ E ∷ Δ) , refl , refl) | inj₁ (.(Δ₀ ++ Λ₁ ++ Ξ') , refl , refl) | inj₂ (.(Λ₁ ++ Ξ') , refl , refl) | inj₂ (Ξ' , refl , refl) | inj₂ ([] , refl , refl) | inj₁ (Θ , refl , refl)
  with Λ₁
... | F ∷ Λ₂
  rewrite ++?-inj₁ (F ∷ Λ₂ ++ Ξ' ++ A' ⇒ B' ∷ Δ) Δ₀ Λ |
          ++?-inj₁ [] (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ F ∷ Λ₂ ++ Ξ') (A' ⇒ B' ∷ Δ ++ Λ) |
          ++?-inj₂ Δ₀ (Λ₂ ++ Ξ') (A' ⇒ B' ∷ Δ) F |
          cases++-inj₁ Γ₁ (Δ₀ ++ F ∷ Λ₂ ++ B' ∷ Δ) Λ (B ⇐ A) |
          ++?-inj₁ [] (Γ₁ ++ B ∷ F ∷ Λ₂ ++ Ξ') (A' ⇒ B' ∷ Δ ++ Λ) |
          cases++-inj₁ Γ₁ (Δ₀ ++ F ∷ Λ₂) (B' ∷ Δ) (B ⇐ A) |
          ++?-inj₁ (F ∷ Λ₂ ++ B' ∷ Δ) Δ₀ Λ |
          ++?-inj₂ Δ₀ Λ₂ (B' ∷ Δ) F =
  intrp≗ (g~ ⇐L⇒L-comm)
... | [] with Ξ'
... | F ∷ Ξ''
  rewrite ++?-inj₁ (F ∷ Ξ'' ++ A' ⇒ B' ∷ Δ) Δ₀ Λ |
          ++?-inj₁ [] (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ F ∷ Ξ'') (A' ⇒ B' ∷ Δ ++ Λ) |
          ++?-inj₂ Δ₀ Ξ'' (A' ⇒ B' ∷ Δ) F |
          ++?-inj₁ [] (Γ₁ ++ B ∷ F ∷ Ξ'') (A' ⇒ B' ∷ Δ ++ Λ) |
          cases++-inj₁ Γ₁ (Δ₀ ++ B' ∷ Δ) Λ (B ⇐ A) |
          cases++-inj₁ Γ₁ Δ₀ (B' ∷ Δ) (B ⇐ A) |
          ++?-inj₁ (B' ∷ Δ) Δ₀ Λ |
          ++?-inj₁ [] Δ₀ (B' ∷ Δ) =
  intrp≗
    (~-trans
      (g~ ⇐L⇒L-comm)
      (⇒L~⇒ refl inner))
  where
    K = mip (Γ₁ ++ B ∷ []) (B' ∷ Δ) Λ g refl
    Γo = Γ₁ ++ B ⇐ A ∷ Δ₀

    body : Γo ++ I ∷ MIP.D K ∷ Λ ⊢ C
    body =
      ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []} {Λ = MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f) (MIP.g K)

    irIL : cut Δ₀ IR (IL {Γ = Δ₀} {Δ = []} f) refl ≗ f
    irIL rewrite cases++-inj₂ [] Δ₀ [] I = refl

    eqg : ⇐L {Γ = Γ₁} {Δ = Δ₀} {Λ = MIP.D K ∷ Λ} f (MIP.g K) ≗
        cut Γo (⊗R IR ax) (⊗L {Γo} {Λ} {I} {MIP.D K} body) refl
    eqg =
      ⇐L {Γ = Γ₁} {Δ = Δ₀} {Λ = MIP.D K ∷ Λ} (~ irIL) refl
      ∘
      ((~ (≡to≗ (cut⇐L-cases++₁ Δ₀ Γ₁
        {Λ = []} {Λ₁ = MIP.D K ∷ Λ}
        {f = IR} {g = IL {Γ = Δ₀} {Δ = []} f} {h = MIP.g K})))
      ∘
      (cut-cong₂ Γo refl
        (~ cutaxA-left (Γo ++ I ∷ []) body refl)
      ∘
      ≡to≗ (cut⊗R⊗Lcases++ Γo Λ
        {f = IR} {g = ax} {h = body})))

    eqh : cut [] (MIP.h K) (⊗R IR ax) refl ≗ ⊗R IR (MIP.h K)
    eqh =
      (~ (≡to≗ (cut⊗Rcases++₂ [] [] []
        {f = MIP.h K} {g = IR} {h = ax})))
      ∘ ⊗R refl (cutaxA-right (MIP.h K))

    inner :
      intrp {Γ = Γo} {Δ = B' ∷ Δ} {Λ = Λ} {C = C} (MIP.D K)
        (⇐L {Γ = Γ₁} {Δ = Δ₀} {Λ = MIP.D K ∷ Λ} f (MIP.g K))
        (MIP.h K) ~
      intrp {Γ = Γo} {Δ = B' ∷ Δ} {Λ = Λ} {C = C}
        (I ⊗ MIP.D K) (⊗L {Γo} {Λ} body) (⊗R IR (MIP.h K))
    inner = ↝∷ (⊗R IR ax , eqg , eqh) refl
... | []
  rewrite ++?-inj₁ (A' ⇒ B' ∷ Δ) Δ₀ Λ |
          ++?-inj₁ [] (Γ₁ ++ B ⇐ A ∷ Δ₀) (A' ⇒ B' ∷ Δ ++ Λ) |
          ++?-inj₁ [] Δ₀ (A' ⇒ B' ∷ Δ) |
          cases++-inj₁ Γ₁ (Δ₀ ++ B' ∷ Δ) Λ (B ⇐ A) |
          ++?-inj₁ [] (Γ₁ ++ B ∷ []) (A' ⇒ B' ∷ Δ ++ Λ) |
          cases++-inj₁ Γ₁ Δ₀ (B' ∷ Δ) (B ⇐ A) |
          ++?-inj₁ (B' ∷ Δ) Δ₀ Λ |
          ++?-inj₁ [] Δ₀ (B' ∷ Δ) =
  intrp≗ (↝∷ (t , eqg , eqh) refl)
  where
    K = mip (Γ₁ ++ B ∷ []) (B' ∷ Δ) Λ g refl
    Γo = Γ₁ ++ B ⇐ A ∷ Δ₀

    body : Γo ++ I ∷ MIP.D K ∷ Λ ⊢ C
    body =
      ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []} {Λ = MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f) (MIP.g K)

    u : I ∷ I ∷ I ⇒ MIP.D K ∷ [] ⊢ MIP.D K
    u =
      IL {Γ = I ∷ []} {Δ = I ⇒ MIP.D K ∷ []}
        (⇒L {Γ = []} {Δ = I ∷ []} {Λ = []}
          {A = I} {B = MIP.D K} ax ax)

    t : I ⊗ (I ⇒ MIP.D K) ∷ [] ⊢ I ⇒ (I ⊗ MIP.D K)
    t =
      ⊗L {[]} (⇒R (⊗R IR u))

    ΓB = Γ₁ ++ B ∷ []

    q : I ∷ I ⇒ MIP.D K ∷ [] ⊢ MIP.D K
    q = ⇒L {Γ = []} {Δ = I ∷ []} {Λ = []}
          {A = I} {B = MIP.D K} ax ax

    qCut : cut ΓB q (MIP.g K) refl ≗
      ⇒L {Γ = ΓB} {Δ = I ∷ []} {Λ = Λ}
        {A = I} {B = MIP.D K} ax
        (cut ΓB ax (MIP.g K) refl)
    qCut =
      cut⇒L≗ ΓB
        {Δ = I ∷ []} {Δ₀ = []} {Δ₁ = []} {Λ = Λ}
        {Ω = ΓB ++ MIP.D K ∷ Λ}
        {A = I} {B = MIP.D K} {C = C} {D = MIP.D K}
        ax ax (MIP.g K) refl

    qInner : ⇒L {Γ = ΓB} {Δ = I ∷ []} {Λ = Λ}
        {A = I} {B = MIP.D K} ax (MIP.g K) ≗
      cut ΓB q (MIP.g K) refl
    qInner =
      (⇒L {Γ = ΓB} {Δ = I ∷ []} {Λ = Λ}
        {A = I} {B = MIP.D K}
        refl (~ (cutaxA-left ΓB (MIP.g K) refl)))
      ∘
      (~ qCut)

    pInner : ⇒L {Γ = ΓB} {Δ = []} {Λ = Λ}
        {A = I} {B = MIP.D K} IR (MIP.g K) ≗
      cut ΓB IR (cut ΓB q (MIP.g K) refl) refl
    pInner =
      (~ (≡to≗ (cut⇒L-cases++-assoc [] ΓB
        {Λ₀ = []} {Λ₁ = Λ}
        {f = IR} {g = ax} {h = MIP.g K})))
      ∘
      cut-cong₂ ΓB refl qInner

    pRight : IL {Γ = ΓB} {Δ = I ⇒ MIP.D K ∷ Λ}
        (⇒L {Γ = ΓB} {Δ = []} {Λ = Λ}
          {A = I} {B = MIP.D K} IR (MIP.g K)) ≗
      cut ΓB IR (cut ΓB u (MIP.g K) refl) refl
    pRight =
      (IL {Γ = ΓB} {Δ = I ⇒ MIP.D K ∷ Λ} pInner)
      ∘
      ((≡to≗ (cutIL-cases++₂ ΓB [] (I ⇒ MIP.D K ∷ Λ)
        {f = IR} {g = cut ΓB q (MIP.g K) refl}))
      ∘
      (~ (cut-cong₂ ΓB refl
        (cutIL≗ ΓB (I ∷ []) (I ⇒ MIP.D K ∷ [])
          q (MIP.g K) refl))))

    right : ΓB ++ I ⇒ MIP.D K ∷ Λ ⊢ C
    right =
      ⇒L {Γ = ΓB} {Δ = []} {Λ = Λ}
        {A = I} {B = MIP.D K} IR (MIP.g K)

    W : ΓB ++ I ∷ I ∷ I ⇒ MIP.D K ∷ Λ ⊢ C
    W = cut ΓB u (MIP.g K) refl

    eqg-move : ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f) right ≗
      ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        f (IL {Γ = ΓB} {Δ = I ⇒ MIP.D K ∷ Λ} right)
    eqg-move =
      (~ (IL⇐L-assoc {Γ = Γ₁} {Δ₀ = Δ₀} {Δ₁ = []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B} {C = C}
        {f = f} {g = right}))
      ∘
      IL⇐L-comm₂ {Γ = Γ₁} {Δ = Δ₀} {Λ = []}
        {Ω = I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B} {C = C}
        {f = f} {g = right}

    eqg-right : ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        f (IL {Γ = ΓB} {Δ = I ⇒ MIP.D K ∷ Λ} right) ≗
      ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        f (cut ΓB IR W refl)
    eqg-right =
      ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B}
        refl pRight

    eqg-cut-left : ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        f (cut ΓB IR W refl) ≗
      cut Γo IR
        (⇐L {Γ = Γ₁} {Δ = Δ₀}
          {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
          f W)
        refl
    eqg-cut-left =
      ~ (≡to≗ (cut⇐L-cases++-comm₁ Γ₁
        {Γ₁ = []} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B} {C = C} {D = I}
        {f = IR} {g = f} {h = W}))

    eqg-cut-inner : ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
        f W ≗
      cut Γo IR
        (⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
          {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
          (IL {Γ = Δ₀} {Δ = []} f) W)
        refl
    eqg-cut-inner =
      (⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B}
        (~ (cutIRIL Δ₀ [] {g = f})) refl)
      ∘
      (~ (≡to≗ (cut⇐L-cases++₁ Δ₀ Γ₁
        {Λ = []}
        {Λ₁ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B} {C = C} {D = I}
        {f = IR} {g = IL {Γ = Δ₀} {Δ = []} f}
        {h = W})))

    eqg-cut : cut Γo IR
        (⇐L {Γ = Γ₁} {Δ = Δ₀}
          {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
          f W)
        refl ≗
      cut Γo IR
        (cut Γo IR
          (⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
            {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
            (IL {Γ = Δ₀} {Δ = []} f) W)
          refl)
        refl
    eqg-cut =
      cut-cong₂ Γo refl eqg-cut-inner

    eqg-seq : ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f)
        (⇒L {Γ = Γ₁ ++ B ∷ []} {Δ = []} {Λ = Λ}
          {A = I} {B = MIP.D K} IR (MIP.g K)) ≗
      cut Γo IR
        (cut Γo IR
          (cut (Γo ++ I ∷ []) u body refl)
          refl)
        refl
    eqg-seq
      rewrite cases++-inj₂ (B ⇐ A ∷ Δ₀ ++ I ∷ []) Γ₁ Λ (MIP.D K) |
              cases++-inj₂ [] (Δ₀ ++ I ∷ []) Λ (MIP.D K) =
      eqg-move ∘ (eqg-right ∘ (eqg-cut-left ∘ eqg-cut))

    eqg-core : ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f)
        (⇒L {Γ = Γ₁ ++ B ∷ []} {Δ = []} {Λ = Λ}
          {A = I} {B = MIP.D K} IR (MIP.g K)) ≗
      cut Γo IR
        (cut Γo (⊗R IR u) (⊗L {Γ = Γo} {Δ = Λ} body) refl)
        refl
    eqg-core =
      eqg-seq
      ∘
      cut-cong₂ Γo refl
        (≡to≗ (cut⊗R⊗Lcases++ Γo Λ
          {f = IR} {g = u} {h = body}))

    eqg-inner : ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f)
        (⇒L {Γ = Γ₁ ++ B ∷ []} {Δ = []} {Λ = Λ}
          {A = I} {B = MIP.D K} IR (MIP.g K)) ≗
      cut Γo (⇒R (⊗R IR u))
        (⇒L {Γ = Γo} {Δ = []} {Λ = Λ}
          {A = I} {B = I ⊗ MIP.D K}
          IR (⊗L {Γ = Γo} {Δ = Λ} body))
        refl
    eqg-inner =
      eqg-core
      ∘
      (~ (≡to≗ (cut⇒R⇒Lcases++ Γo Λ []
        {f = ⊗R IR u}
        {g = IR}
        {h = ⊗L {Γ = Γo} {Δ = Λ} body})))

    eqg : ⊗L {Γ = Γo} {Δ = Λ}
        (⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
          {Λ = I ⇒ MIP.D K ∷ Λ}
          (IL {Γ = Δ₀} {Δ = []} f)
          (⇒L {Γ = Γ₁ ++ B ∷ []} {Δ = []} {Λ = Λ}
            {A = I} {B = MIP.D K} IR (MIP.g K))) ≗
      cut Γo t
        (⇒L {Γ = Γo} {Δ = []} {Λ = Λ}
          {A = I} {B = I ⊗ MIP.D K}
          IR (⊗L {Γ = Γo} {Δ = Λ} body))
        refl
    eqg =
      ⊗L {Γ = Γo} {Δ = Λ} eqg-inner
      ∘
      (~ (cut⊗L≗ Γo [] []
        (⇒R (⊗R IR u))
        (⇒L {Γ = Γo} {Δ = []} {Λ = Λ}
          {A = I} {B = I ⊗ MIP.D K}
          IR (⊗L {Γ = Γo} {Δ = Λ} body))
        refl))

    eqh : cut [] (⊗R IR
        (⇒R {Γ = A' ⇒ B' ∷ Δ} {A = I} {B = MIP.D K}
          (⇒L {Γ = []} {Δ = I ∷ []} {Λ = Δ} {A = A'} {B = B'}
            (IL {Γ = []} {Δ = []} f') (MIP.h K)))) t refl ≗
      ⇒R {Γ = A' ⇒ B' ∷ Δ} {A = I} {B = I ⊗ MIP.D K}
        (⇒L {Γ = []} {Δ = I ∷ []} {Λ = Δ} {A = A'} {B = B'}
          (IL {Γ = []} {Δ = []} f') (⊗R IR (MIP.h K)))
    eqh = ⇒R {Γ = A' ⇒ B' ∷ Δ} {A = I} {B = I ⊗ MIP.D K}
      (~ (⇒L⊗R₂ {Γ = []} {Δ = I ∷ []} {Λ = Δ} {Ω = []}
      {A = A'} {B = B'} {A' = I} {B' = MIP.D K}
      {f = IL {Γ = []} {Δ = []} f'} {g = IR} {h = MIP.h K}))
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Ξ') (E ∷ Δ) Λ {Γ₁} {Δ₀} {.(Ξ' ++ x ∷ Ξ'')} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.((Δ₀ ++ Λ₁ ++ Ξ') ++ E ∷ Δ) , refl , refl) | inj₁ (.(Δ₀ ++ Λ₁ ++ Ξ') , refl , refl) | inj₂ (.(Λ₁ ++ Ξ') , refl , refl) | inj₂ (Ξ' , refl , refl) | inj₂ (x ∷ Ξ'' , refl , refl) | inj₁ (Θ , refl , refl)
  with Λ₁
... | F ∷ Λ₂
  rewrite ++?-inj₁ (F ∷ Λ₂ ++ Ξ' ++ E ∷ Ξ'' ++ A' ⇒ B' ∷ Θ) Δ₀ Λ |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ F ∷ Λ₂ ++ Ξ') Ξ'' (A' ⇒ B' ∷ Θ ++ Λ) E |
          ++?-inj₂ Δ₀ (Λ₂ ++ Ξ') (E ∷ Ξ'' ++ A' ⇒ B' ∷ Θ) F |
          ++?-inj₂ (Γ₁ ++ B ∷ F ∷ Λ₂ ++ Ξ') Ξ'' (A' ⇒ B' ∷ Θ ++ Λ) E |
          cases++-inj₂ Ξ' (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ F ∷ Λ₂) Ξ'' E |
          cases++-inj₂ Ξ' (Γ₁ ++ B ∷ F ∷ Λ₂) Ξ'' E |
          cases++-inj₁ Ξ'' Θ Λ (A' ⇒ B') |
          cases++-inj₁ Γ₁ (Δ₀ ++ F ∷ Λ₂ ++ B' ∷ Θ) Λ (B ⇐ A) |
          cases++-inj₁ Γ₁ (Δ₀ ++ F ∷ Λ₂) (B' ∷ Θ) (B ⇐ A) |
          ++?-inj₁ (F ∷ Λ₂ ++ B' ∷ Θ) Δ₀ Λ |
          ++?-inj₂ Δ₀ Λ₂ (B' ∷ Θ) F =
  intrp≗ (g~ ⇐L⇒L-comm)
... | [] with Ξ'
... | F ∷ Ξ₀
  rewrite ++?-inj₁ (F ∷ Ξ₀ ++ E ∷ Ξ'' ++ A' ⇒ B' ∷ Θ) Δ₀ Λ |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ F ∷ Ξ₀) Ξ'' (A' ⇒ B' ∷ Θ ++ Λ) E |
          ++?-inj₂ Δ₀ Ξ₀ (E ∷ Ξ'' ++ A' ⇒ B' ∷ Θ) F |
          ++?-inj₂ (Γ₁ ++ B ∷ F ∷ Ξ₀) Ξ'' (A' ⇒ B' ∷ Θ ++ Λ) E |
          cases++-inj₂ (F ∷ Ξ₀) (Γ₁ ++ B ⇐ A ∷ Δ₀) Ξ'' E |
          cases++-inj₂ (F ∷ Ξ₀) (Γ₁ ++ B ∷ []) Ξ'' E |
          cases++-inj₁ Ξ'' Θ Λ (A' ⇒ B') |
          cases++-inj₁ Γ₁ (Δ₀ ++ B' ∷ Θ) Λ (B ⇐ A) |
          cases++-inj₁ Γ₁ Δ₀ (B' ∷ Θ) (B ⇐ A) |
          ++?-inj₁ (B' ∷ Θ) Δ₀ Λ |
          ++?-inj₁ [] Δ₀ (B' ∷ Θ) =
  intrp≗
    (~-trans
      (g~ ⇐L⇒L-comm)
      (⇒L~⇒ refl inner))
  where
    K = mip (Γ₁ ++ B ∷ []) (B' ∷ Θ) Λ g refl
    Γo = Γ₁ ++ B ⇐ A ∷ Δ₀

    body : Γo ++ I ∷ MIP.D K ∷ Λ ⊢ C
    body =
      ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []} {Λ = MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f) (MIP.g K)

    irIL : cut Δ₀ IR (IL {Γ = Δ₀} {Δ = []} f) refl ≗ f
    irIL rewrite cases++-inj₂ [] Δ₀ [] I = refl

    eqg : ⇐L {Γ = Γ₁} {Δ = Δ₀} {Λ = MIP.D K ∷ Λ} f (MIP.g K) ≗
        cut Γo (⊗R IR ax) (⊗L {Γo} {Λ} {I} {MIP.D K} body) refl
    eqg =
      ⇐L {Γ = Γ₁} {Δ = Δ₀} {Λ = MIP.D K ∷ Λ} (~ irIL) refl
      ∘
      ((~ (≡to≗ (cut⇐L-cases++₁ Δ₀ Γ₁
        {Λ = []} {Λ₁ = MIP.D K ∷ Λ}
        {f = IR} {g = IL {Γ = Δ₀} {Δ = []} f} {h = MIP.g K})))
      ∘
      (cut-cong₂ Γo refl
        (~ cutaxA-left (Γo ++ I ∷ []) body refl)
      ∘
      ≡to≗ (cut⊗R⊗Lcases++ Γo Λ
        {f = IR} {g = ax} {h = body})))

    eqh : cut [] (MIP.h K) (⊗R IR ax) refl ≗ ⊗R IR (MIP.h K)
    eqh =
      (~ (≡to≗ (cut⊗Rcases++₂ [] [] []
        {f = MIP.h K} {g = IR} {h = ax})))
      ∘ ⊗R refl (cutaxA-right (MIP.h K))

    inner :
      intrp {Γ = Γo} {Δ = B' ∷ Θ} {Λ = Λ} {C = C} (MIP.D K)
        (⇐L {Γ = Γ₁} {Δ = Δ₀} {Λ = MIP.D K ∷ Λ} f (MIP.g K))
        (MIP.h K) ~
      intrp {Γ = Γo} {Δ = B' ∷ Θ} {Λ = Λ} {C = C}
        (I ⊗ MIP.D K) (⊗L {Γo} {Λ} body) (⊗R IR (MIP.h K))
    inner = ↝∷ (⊗R IR ax , eqg , eqh) refl
... | []
  rewrite ++?-inj₁ (E ∷ Ξ'' ++ A' ⇒ B' ∷ Θ) Δ₀ Λ |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀) Ξ'' (A' ⇒ B' ∷ Θ ++ Λ) E |
          ++?-inj₁ [] Δ₀ (E ∷ Ξ'' ++ A' ⇒ B' ∷ Θ) |
          ++?-inj₂ (Γ₁ ++ B ∷ []) Ξ'' (A' ⇒ B' ∷ Θ ++ Λ) E |
          cases++-inj₂ [] (Γ₁ ++ B ⇐ A ∷ Δ₀) Ξ'' E |
          cases++-inj₂ [] (Γ₁ ++ B ∷ []) Ξ'' E |
          cases++-inj₁ Ξ'' Θ Λ (A' ⇒ B') |
          cases++-inj₁ Γ₁ (Δ₀ ++ B' ∷ Θ) Λ (B ⇐ A) |
          cases++-inj₁ Γ₁ Δ₀ (B' ∷ Θ) (B ⇐ A) |
          ++?-inj₁ (B' ∷ Θ) Δ₀ Λ |
          ++?-inj₁ [] Δ₀ (B' ∷ Θ) =
  intrp≗ (↝∷ (t , eqg , eqh) refl)
  where
    K = mip (Γ₁ ++ B ∷ []) (B' ∷ Θ) Λ g refl
    Γo = Γ₁ ++ B ⇐ A ∷ Δ₀

    body : Γo ++ I ∷ MIP.D K ∷ Λ ⊢ C
    body =
      ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []} {Λ = MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f) (MIP.g K)

    u : I ∷ I ∷ I ⇒ MIP.D K ∷ [] ⊢ MIP.D K
    u =
      IL {Γ = I ∷ []} {Δ = I ⇒ MIP.D K ∷ []}
        (⇒L {Γ = []} {Δ = I ∷ []} {Λ = []}
          {A = I} {B = MIP.D K} ax ax)

    t : I ⊗ (I ⇒ MIP.D K) ∷ [] ⊢ I ⇒ (I ⊗ MIP.D K)
    t =
      ⊗L {[]} (⇒R (⊗R IR u))

    ΓB = Γ₁ ++ B ∷ []

    q : I ∷ I ⇒ MIP.D K ∷ [] ⊢ MIP.D K
    q = ⇒L {Γ = []} {Δ = I ∷ []} {Λ = []}
          {A = I} {B = MIP.D K} ax ax

    qCut : cut ΓB q (MIP.g K) refl ≗
      ⇒L {Γ = ΓB} {Δ = I ∷ []} {Λ = Λ}
        {A = I} {B = MIP.D K} ax
        (cut ΓB ax (MIP.g K) refl)
    qCut =
      cut⇒L≗ ΓB
        {Δ = I ∷ []} {Δ₀ = []} {Δ₁ = []} {Λ = Λ}
        {Ω = ΓB ++ MIP.D K ∷ Λ}
        {A = I} {B = MIP.D K} {C = C} {D = MIP.D K}
        ax ax (MIP.g K) refl

    qInner : ⇒L {Γ = ΓB} {Δ = I ∷ []} {Λ = Λ}
        {A = I} {B = MIP.D K} ax (MIP.g K) ≗
      cut ΓB q (MIP.g K) refl
    qInner =
      (⇒L {Γ = ΓB} {Δ = I ∷ []} {Λ = Λ}
        {A = I} {B = MIP.D K}
        refl (~ (cutaxA-left ΓB (MIP.g K) refl)))
      ∘
      (~ qCut)

    pInner : ⇒L {Γ = ΓB} {Δ = []} {Λ = Λ}
        {A = I} {B = MIP.D K} IR (MIP.g K) ≗
      cut ΓB IR (cut ΓB q (MIP.g K) refl) refl
    pInner =
      (~ (≡to≗ (cut⇒L-cases++-assoc [] ΓB
        {Λ₀ = []} {Λ₁ = Λ}
        {f = IR} {g = ax} {h = MIP.g K})))
      ∘
      cut-cong₂ ΓB refl qInner

    pRight : IL {Γ = ΓB} {Δ = I ⇒ MIP.D K ∷ Λ}
        (⇒L {Γ = ΓB} {Δ = []} {Λ = Λ}
          {A = I} {B = MIP.D K} IR (MIP.g K)) ≗
      cut ΓB IR (cut ΓB u (MIP.g K) refl) refl
    pRight =
      (IL {Γ = ΓB} {Δ = I ⇒ MIP.D K ∷ Λ} pInner)
      ∘
      ((≡to≗ (cutIL-cases++₂ ΓB [] (I ⇒ MIP.D K ∷ Λ)
        {f = IR} {g = cut ΓB q (MIP.g K) refl}))
      ∘
      (~ (cut-cong₂ ΓB refl
        (cutIL≗ ΓB (I ∷ []) (I ⇒ MIP.D K ∷ [])
          q (MIP.g K) refl))))

    right : ΓB ++ I ⇒ MIP.D K ∷ Λ ⊢ C
    right =
      ⇒L {Γ = ΓB} {Δ = []} {Λ = Λ}
        {A = I} {B = MIP.D K} IR (MIP.g K)

    W : ΓB ++ I ∷ I ∷ I ⇒ MIP.D K ∷ Λ ⊢ C
    W = cut ΓB u (MIP.g K) refl

    eqg-move : ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f) right ≗
      ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        f (IL {Γ = ΓB} {Δ = I ⇒ MIP.D K ∷ Λ} right)
    eqg-move =
      (~ (IL⇐L-assoc {Γ = Γ₁} {Δ₀ = Δ₀} {Δ₁ = []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B} {C = C}
        {f = f} {g = right}))
      ∘
      IL⇐L-comm₂ {Γ = Γ₁} {Δ = Δ₀} {Λ = []}
        {Ω = I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B} {C = C}
        {f = f} {g = right}

    eqg-right : ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        f (IL {Γ = ΓB} {Δ = I ⇒ MIP.D K ∷ Λ} right) ≗
      ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        f (cut ΓB IR W refl)
    eqg-right =
      ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B}
        refl pRight

    eqg-cut-left : ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        f (cut ΓB IR W refl) ≗
      cut Γo IR
        (⇐L {Γ = Γ₁} {Δ = Δ₀}
          {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
          f W)
        refl
    eqg-cut-left =
      ~ (≡to≗ (cut⇐L-cases++-comm₁ Γ₁
        {Γ₁ = []} {Δ = Δ₀}
        {Λ = I ∷ I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B} {C = C} {D = I}
        {f = IR} {g = f} {h = W}))

    eqg-cut-inner : ⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
        f W ≗
      cut Γo IR
        (⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
          {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
          (IL {Γ = Δ₀} {Δ = []} f) W)
        refl
    eqg-cut-inner =
      (⇐L {Γ = Γ₁} {Δ = Δ₀}
        {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B}
        (~ (cutIRIL Δ₀ [] {g = f})) refl)
      ∘
      (~ (≡to≗ (cut⇐L-cases++₁ Δ₀ Γ₁
        {Λ = []}
        {Λ₁ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
        {A = A} {B = B} {C = C} {D = I}
        {f = IR} {g = IL {Γ = Δ₀} {Δ = []} f}
        {h = W})))

    eqg-cut : cut Γo IR
        (⇐L {Γ = Γ₁} {Δ = Δ₀}
          {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
          f W)
        refl ≗
      cut Γo IR
        (cut Γo IR
          (⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
            {Λ = I ∷ I ∷ I ⇒ MIP.D K ∷ Λ}
            (IL {Γ = Δ₀} {Δ = []} f) W)
          refl)
        refl
    eqg-cut =
      cut-cong₂ Γo refl eqg-cut-inner

    eqg-seq : ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f)
        (⇒L {Γ = Γ₁ ++ B ∷ []} {Δ = []} {Λ = Λ}
          {A = I} {B = MIP.D K} IR (MIP.g K)) ≗
      cut Γo IR
        (cut Γo IR
          (cut (Γo ++ I ∷ []) u body refl)
          refl)
        refl
    eqg-seq
      rewrite cases++-inj₂ (B ⇐ A ∷ Δ₀ ++ I ∷ []) Γ₁ Λ (MIP.D K) |
              cases++-inj₂ [] (Δ₀ ++ I ∷ []) Λ (MIP.D K) =
      eqg-move ∘ (eqg-right ∘ (eqg-cut-left ∘ eqg-cut))

    eqg-core : ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f)
        (⇒L {Γ = Γ₁ ++ B ∷ []} {Δ = []} {Λ = Λ}
          {A = I} {B = MIP.D K} IR (MIP.g K)) ≗
      cut Γo IR
        (cut Γo (⊗R IR u) (⊗L {Γ = Γo} {Δ = Λ} body) refl)
        refl
    eqg-core =
      eqg-seq
      ∘
      cut-cong₂ Γo refl
        (≡to≗ (cut⊗R⊗Lcases++ Γo Λ
          {f = IR} {g = u} {h = body}))

    eqg-inner : ⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
        {Λ = I ⇒ MIP.D K ∷ Λ}
        (IL {Γ = Δ₀} {Δ = []} f)
        (⇒L {Γ = Γ₁ ++ B ∷ []} {Δ = []} {Λ = Λ}
          {A = I} {B = MIP.D K} IR (MIP.g K)) ≗
      cut Γo (⇒R (⊗R IR u))
        (⇒L {Γ = Γo} {Δ = []} {Λ = Λ}
          {A = I} {B = I ⊗ MIP.D K}
          IR (⊗L {Γ = Γo} {Δ = Λ} body))
        refl
    eqg-inner =
      eqg-core
      ∘
      (~ (≡to≗ (cut⇒R⇒Lcases++ Γo Λ []
        {f = ⊗R IR u}
        {g = IR}
        {h = ⊗L {Γ = Γo} {Δ = Λ} body})))

    eqg : ⊗L {Γ = Γo} {Δ = Λ}
        (⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
          {Λ = I ⇒ MIP.D K ∷ Λ}
          (IL {Γ = Δ₀} {Δ = []} f)
          (⇒L {Γ = Γ₁ ++ B ∷ []} {Δ = []} {Λ = Λ}
            {A = I} {B = MIP.D K} IR (MIP.g K))) ≗
      cut Γo t
        (⇒L {Γ = Γo} {Δ = []} {Λ = Λ}
          {A = I} {B = I ⊗ MIP.D K}
          IR (⊗L {Γ = Γo} {Δ = Λ} body))
        refl
    eqg =
      ⊗L {Γ = Γo} {Δ = Λ} eqg-inner
      ∘
      (~ (cut⊗L≗ Γo [] []
        (⇒R (⊗R IR u))
        (⇒L {Γ = Γo} {Δ = []} {Λ = Λ}
          {A = I} {B = I ⊗ MIP.D K}
          IR (⊗L {Γ = Γo} {Δ = Λ} body))
        refl))

    eqh : cut [] (⊗R IR
        (⇒R {Γ = E ∷ Ξ'' ++ A' ⇒ B' ∷ Θ} {A = I} {B = MIP.D K}
          (⇒L {Γ = []} {Δ = I ∷ E ∷ Ξ''} {Λ = Θ} {A = A'} {B = B'}
            (IL {Γ = []} {Δ = E ∷ Ξ''} f') (MIP.h K)))) t refl ≗
      ⇒R {Γ = E ∷ Ξ'' ++ A' ⇒ B' ∷ Θ} {A = I} {B = I ⊗ MIP.D K}
        (⇒L {Γ = []} {Δ = I ∷ E ∷ Ξ''} {Λ = Θ} {A = A'} {B = B'}
          (IL {Γ = []} {Δ = E ∷ Ξ''} f') (⊗R IR (MIP.h K)))
    eqh = ⇒R {Γ = E ∷ Ξ'' ++ A' ⇒ B' ∷ Θ} {A = I} {B = I ⊗ MIP.D K}
      (~ (⇒L⊗R₂ {Γ = []} {Δ = I ∷ E ∷ Ξ''} {Λ = Θ} {Ω = []}
      {A = A'} {B = B'} {A' = I} {B' = MIP.D K}
      {f = IL {Γ = []} {Δ = E ∷ Ξ''} f'} {g = IR} {h = MIP.h K}))
mip≗⇐L⇒L-comm .(Γ₁ ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Ξ') (E ∷ Δ) Λ {Γ₁} {Δ₀} {.(Ξ' ++ Ξ'')} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (.((Δ₀ ++ Λ₁ ++ Ξ') ++ E ∷ Δ) , refl , refl) | inj₁ (.(Δ₀ ++ Λ₁ ++ Ξ') , refl , refl) | inj₂ (.(Λ₁ ++ Ξ') , refl , refl) | inj₂ (Ξ' , refl , refl) | inj₂ (Ξ'' , refl , refl) | inj₂ (Θ , refl , refl)
  rewrite ++?-inj₁ (Λ₁ ++ Ξ' ++ E ∷ Δ) Δ₀ (Θ ++ A' ⇒ B' ∷ Ξ)
  with Λ₁
... | F ∷ Λ₂
  rewrite ++?-inj₂ Δ₀ (Λ₂ ++ Ξ') (E ∷ Δ) F |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ F ∷ Λ₂ ++ Ξ') (Δ ++ Θ) (A' ⇒ B' ∷ Ξ) E |
          ++?-inj₂ (Γ₁ ++ B ∷ F ∷ Λ₂ ++ Ξ') (Δ ++ Θ) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₂ Ξ' (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ F ∷ Λ₂) (Δ ++ Θ) E |
          cases++-inj₂ Ξ' (Γ₁ ++ B ∷ F ∷ Λ₂) (Δ ++ Θ) E |
          cases++-inj₂ Θ Δ Ξ (A' ⇒ B') =
  intrp≗ (g~ ⇐L⇒L-comm)
... | [] with Ξ'
... | []
  rewrite ++?-inj₁ [] Δ₀ (E ∷ Δ) |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀) (Δ ++ Θ) (A' ⇒ B' ∷ Ξ) E |
          ++?-inj₂ (Γ₁ ++ B ∷ []) (Δ ++ Θ) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₂ [] (Γ₁ ++ B ⇐ A ∷ Δ₀) (Δ ++ Θ) E |
          cases++-inj₂ [] (Γ₁ ++ B ∷ []) (Δ ++ Θ) E |
          cases++-inj₂ Θ Δ Ξ (A' ⇒ B') =
  intrp≗ (↝∷ (t , eqg , eqh) refl)
  where
    K = mip [] (E ∷ Δ) Θ f' refl
    Γo = Γ₁ ++ B ⇐ A ∷ Δ₀

    t : I ⊗ MIP.D K ∷ [] ⊢ MIP.D K
    t = ⊗L {Γ = []} {Δ = []}
          (IL {Γ = []} {Δ = MIP.D K ∷ []} ax)

    eqg : ⊗L {Γ = Γo} {Δ = Θ ++ A' ⇒ B' ∷ Ξ}
        (⇐L {Γ = Γ₁} {Δ = Δ₀ ++ I ∷ []}
          {Λ = MIP.D K ∷ Θ ++ A' ⇒ B' ∷ Ξ}
          (IL {Γ = Δ₀} {Δ = []} f)
          (⇒L {Γ = Γ₁ ++ B ∷ []} {Δ = MIP.D K ∷ Θ} {Λ = Ξ}
            (MIP.g K) g)) ≗
      cut Γo t
        (⇒L {Γ = Γo} {Δ = MIP.D K ∷ Θ} {Λ = Ξ}
          (MIP.g K) (⇐L {Γ = Γ₁} {Δ = Δ₀} {Λ = B' ∷ Ξ} f g))
        refl
    eqg =
      (⊗L {Γ = Γo} {Δ = Θ ++ A' ⇒ B' ∷ Ξ} ⇐L⇒L-comm)
      ∘
      ((⊗L {Γ = Γo} {Δ = Θ ++ A' ⇒ B' ∷ Ξ}
          (⇒L refl (~ (IL⇐L-assoc {Γ = Γ₁} {Δ₀ = Δ₀}
            {Δ₁ = []} {Λ = B' ∷ Ξ}))))
      ∘
      ((⊗L {Γ = Γo} {Δ = Θ ++ A' ⇒ B' ∷ Ξ}
          (~ (IL⇒L-comm₁ {Γ = Γo} {Δ = MIP.D K ∷ Θ}
            {Λ = []} {Ω = Ξ})))
      ∘
      ((⊗L {Γ = Γo} {Δ = Θ ++ A' ⇒ B' ∷ Ξ}
          (IL⇒L-assoc {Γ = Γo} {Δ₀ = []}
            {Δ₁ = MIP.D K ∷ Θ} {Λ = Ξ}))
      ∘
      ((⊗L⇒L-assoc {Γ = Γo} {Δ₀ = []} {Δ₁ = Θ})
      ∘
      ((⇒L
        ((⊗L {Γ = []} {Δ = Θ}
          (~
            ((cutIL≗ [] [] (MIP.D K ∷ []) ax (MIP.g K) refl)
            ∘
            (IL {Γ = []} {Δ = MIP.D K ∷ Θ}
              (cutaxA-left [] (MIP.g K) refl)))))
        ∘
        (~ (cut⊗L≗ [] [] []
          (IL {Γ = []} {Δ = MIP.D K ∷ []} ax) (MIP.g K) refl)))
        refl)
      ∘
      (~ (≡to≗ (cut⇒L-cases++₁ [] Γo {Λ = Θ} {Λ₁ = Ξ}))))))))

    eqh : cut [] (⊗R IR (MIP.h K)) t refl ≗ MIP.h K
    eqh = refl
... | F ∷ Ξ₀
  rewrite ++?-inj₂ Δ₀ Ξ₀ (E ∷ Δ) F |
          ++?-inj₂ (Γ₁ ++ B ⇐ A ∷ Δ₀ ++ F ∷ Ξ₀) (Δ ++ Θ) (A' ⇒ B' ∷ Ξ) E |
          ++?-inj₂ (Γ₁ ++ B ∷ F ∷ Ξ₀) (Δ ++ Θ) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₂ (F ∷ Ξ₀) (Γ₁ ++ B ⇐ A ∷ Δ₀) (Δ ++ Θ) E |
          cases++-inj₂ (F ∷ Ξ₀) (Γ₁ ++ B ∷ []) (Δ ++ Θ) E |
          cases++-inj₂ Θ Δ Ξ (A' ⇒ B') =
  intrp≗ (g~ ⇐L⇒L-comm)
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₂ ([] , refl , refl) 
  with cases++ (Δ₀ ++ Λ₁ ++ Δ₁) Δ Ξ Λ (sym eq2)
mip≗⇐L⇒L-comm Γ (.(B ⇐ A) ∷ Δ) Λ {.(Γ ++ [])} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (Δ , refl , refl) | inj₂ ([] , refl , refl) | inj₁ (Ω'' , refl , refl)
  rewrite ++?-inj₁ (Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ω'') Δ₀ Λ |
          ++?-inj₂ Γ (Δ₀ ++ Λ₁ ++ Δ₁) (A' ⇒ B' ∷ Ω'' ++ Λ) (B ⇐ A) |
          ++?-inj₂ Γ (Λ₁ ++ Δ₁) (A' ⇒ B' ∷ Ω'' ++ Λ) B |
          cases++-inj₁ Γ (Δ₀ ++ Λ₁) Δ₁ (B ⇐ A) |
          cases++-inj₁ Γ Λ₁ Δ₁ B |
          cases++-inj₁ ((Δ₀ ++ Λ₁) ++ Δ₁) Ω'' Λ (A' ⇒ B') |
          cases++-inj₁ (Λ₁ ++ Δ₁) Ω'' Λ (A' ⇒ B') |
          cases++-inj₁ Γ (Δ₀ ++ Λ₁ ++ B' ∷ Ω'') Λ (B ⇐ A) |
          cases++-inj₂ [] Γ (Δ₀ ++ Λ₁ ++ B' ∷ Ω'') (B ⇐ A) |
          ++?-inj₁ (Λ₁ ++ B' ∷ Ω'') Δ₀ Λ =
  intrp≗ (h~ ⇐L⇒L-comm)
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₂ ([] , refl , refl)  | inj₂ (Ω'' , refl , eq4) 
  with ++? Δ Δ₀ Ω'' (Λ₁ ++ Δ₁) eq4
... | inj₁ (Ξ , eq5 , refl) 
  with ++? Ξ Λ₁ Ω'' Δ₁ eq5
mip≗⇐L⇒L-comm Γ (.(B ⇐ A) ∷ .(Δ₀ ++ Ξ)) .(Ω'' ++ A' ⇒ B' ∷ Ξ₁) {.(Γ ++ [])} {Δ₀} {Δ₁} {Λ₁} {Ξ₁} {A} {B} {A'} {B'} refl | inj₁ (.(Δ₀ ++ Ξ) , refl , refl) | inj₂ ([] , refl , refl) | inj₂ (Ω'' , refl , refl) | inj₁ (Ξ , refl , refl) | inj₁ (Ξ' , refl , refl)
  rewrite ++?-inj₁ (Λ₁ ++ Ξ') Δ₀ (Ω'' ++ A' ⇒ B' ∷ Ξ₁)
  with Λ₁
... | []
  rewrite ++?-inj₂ Γ (Ξ' ++ Ω'') (A' ⇒ B' ∷ Ξ₁) B |
          cases++-inj₁ Γ [] (Ξ' ++ Ω'') B |
          cases++-inj₂ Ω'' Ξ' Ξ₁ (A' ⇒ B') |
          ++?-inj₁ Ξ' [] Ω'' |
          ++?-inj₂ Γ (Δ₀ ++ Ξ' ++ Ω'') (A' ⇒ B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₁ Γ Δ₀ (Ξ' ++ Ω'') (B ⇐ A) |
          cases++-inj₂ Ω'' (Δ₀ ++ Ξ') Ξ₁ (A' ⇒ B') |
          ++?-inj₁ Ξ' Δ₀ Ω'' |
          cases++-inj₁ Γ Δ₀ (B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₂ [] Γ Δ₀ (B ⇐ A) |
          ++?-inj₁ [] Δ₀ (B' ∷ Ξ₁) =
  intrp≗ (h~ ⇐L⊗R₁)
... | F ∷ Λ₂
  rewrite ++?-inj₂ Γ (F ∷ Λ₂ ++ Ξ' ++ Ω'') (A' ⇒ B' ∷ Ξ₁) B |
          cases++-inj₁ Γ (F ∷ Λ₂) (Ξ' ++ Ω'') B |
          cases++-inj₂ Ω'' (F ∷ Λ₂ ++ Ξ') Ξ₁ (A' ⇒ B') |
          ++?-inj₁ Ξ' (F ∷ Λ₂) Ω'' |
          ++?-inj₂ Γ (Δ₀ ++ F ∷ Λ₂ ++ Ξ' ++ Ω'') (A' ⇒ B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₁ Γ (Δ₀ ++ F ∷ Λ₂) (Ξ' ++ Ω'') (B ⇐ A) |
          cases++-inj₂ Ω'' (Δ₀ ++ F ∷ Λ₂ ++ Ξ') Ξ₁ (A' ⇒ B') |
          ++?-inj₁ Ξ' (Δ₀ ++ F ∷ Λ₂) Ω'' |
          cases++-inj₁ Γ (Δ₀ ++ F ∷ Λ₂) (B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₂ [] Γ (Δ₀ ++ F ∷ Λ₂) (B ⇐ A) |
          ++?-inj₁ (F ∷ Λ₂) Δ₀ (B' ∷ Ξ₁) =
  intrp≗ (h~ ⇐L⊗R₁)
mip≗⇐L⇒L-comm Γ (.(B ⇐ A) ∷ .(Δ₀ ++ Ξ)) .(Ω'' ++ A' ⇒ B' ∷ Ξ₁) {.(Γ ++ [])} {Δ₀} {Δ₁} {Λ₁} {Ξ₁} {A} {B} {A'} {B'} refl | inj₁ (.(Δ₀ ++ Ξ) , refl , refl) | inj₂ ([] , refl , refl) | inj₂ (Ω'' , refl , refl) | inj₁ (Ξ , refl , refl) | inj₂ (F , Ξ' , refl , refl)
  rewrite ++?-inj₁ Ξ Δ₀ (F ∷ Ξ' ++ Δ₁ ++ A' ⇒ B' ∷ Ξ₁) |
          ++?-inj₂ Γ (Ξ ++ F ∷ Ξ' ++ Δ₁) (A' ⇒ B' ∷ Ξ₁) B |
          cases++-inj₁ Γ (Ξ ++ F ∷ Ξ') Δ₁ B |
          cases++-inj₂ (F ∷ Ξ' ++ Δ₁) Ξ Ξ₁ (A' ⇒ B') |
          ++?-inj₂ Ξ Ξ' Δ₁ F |
          ++?-inj₂ Γ (Δ₀ ++ Ξ ++ F ∷ Ξ' ++ Δ₁) (A' ⇒ B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₁ Γ (Δ₀ ++ Ξ ++ F ∷ Ξ') Δ₁ (B ⇐ A) |
          cases++-inj₂ (F ∷ Ξ' ++ Δ₁) (Δ₀ ++ Ξ) Ξ₁ (A' ⇒ B') |
          ++?-inj₂ (Δ₀ ++ Ξ) Ξ' Δ₁ F |
          cases++-inj₁ Γ (Δ₀ ++ Ξ) (F ∷ Ξ' ++ B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₂ [] Γ (Δ₀ ++ Ξ) (B ⇐ A) |
          ++?-inj₁ Ξ Δ₀ (F ∷ Ξ' ++ B' ∷ Ξ₁) =
  intrp≗ refl
mip≗⇐L⇒L-comm Γ (.(B ⇐ A) ∷ Δ) .(Ω'' ++ A' ⇒ B' ∷ Ξ₁) {.(Γ ++ [])} {Δ₀} {Δ₁} {Λ₁} {Ξ₁} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (Δ , refl , refl) | inj₂ ([] , refl , refl) | inj₂ (Ω'' , refl , refl) | inj₂ (F , Ξ , refl , refl)
  rewrite ++?-inj₂ Δ Ξ (Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ₁) F |
          ++?-inj₂ Γ (Δ ++ F ∷ Ξ ++ Λ₁ ++ Δ₁) (A' ⇒ B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₁ Γ (Δ ++ F ∷ Ξ ++ Λ₁) Δ₁ (B ⇐ A) |
          cases++-inj₂ (F ∷ Ξ ++ Λ₁ ++ Δ₁) Δ Ξ₁ (A' ⇒ B') |
          ++?-inj₂ Δ (Ξ ++ Λ₁) Δ₁ F
  with Λ₁ | Δ₁
... | [] | []
  rewrite ++?-inj₂ Γ [] (A' ⇒ B' ∷ Ξ₁) B |
          cases++-inj₁ Γ [] [] B |
          cases++-inj₂ [] [] Ξ₁ (A' ⇒ B') |
          ++?-inj₁ {X = Fma} [] [] [] |
          cases++-inj₁ Γ Δ (F ∷ Ξ ++ B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₂ [] Γ Δ (B ⇐ A) |
          ++?-inj₂ Δ Ξ (B' ∷ Ξ₁) F =
  intrp≗ (~-trans (⇐L~⇐ refl inner)
    (g~ (⇐L⇒L-comm {Γ = Γ} {Δ₀ = F ∷ Ξ} {Δ₁ = []}
      {Λ = []} {Ξ = Ξ₁})))
  where
    Df = mip Δ (F ∷ Ξ) [] f refl
    Kg = mip Γ (B ∷ []) (B' ∷ Ξ₁) g refl

    body : Γ ++ MIP.D Kg ∷ I ∷ A' ⇒ B' ∷ Ξ₁ ⊢ C
    body = ⇒L {Γ = Γ ++ MIP.D Kg ∷ []} {Δ = I ∷ []} {Λ = Ξ₁}
      (IL {Γ = []} {Δ = []} f') (MIP.g Kg)

    eqg : ⇒L {Γ = Γ ++ MIP.D Kg ∷ []} {Δ = []} {Λ = Ξ₁} f' (MIP.g Kg) ≗
      cut Γ (⊗R ax IR) (⊗L {Γ = Γ} {Δ = A' ⇒ B' ∷ Ξ₁} body) refl
    eqg =
      ⇒L {Γ = Γ ++ MIP.D Kg ∷ []} (~ (cutIRIL [] [] {g = f'})) refl
      ∘
      (((~ (≡to≗ (cut⇒L-cases++-assoc [] (Γ ++ MIP.D Kg ∷ [])
        {Λ₀ = []} {Λ₁ = Ξ₁}
        {f = IR} {g = IL {Γ = []} {Δ = []} f'} {h = MIP.g Kg})))
      ∘
      (~ cutaxA-left Γ (cut (Γ ++ MIP.D Kg ∷ []) IR body refl) refl))
      ∘
      ≡to≗ (cut⊗R⊗Lcases++ Γ (A' ⇒ B' ∷ Ξ₁)
        {f = ax} {g = IR} {h = body}))

    eqh : cut [] (MIP.h Kg) (⊗R ax IR) refl ≗ ⊗R (MIP.h Kg) IR
    eqh =
      (~ (≡to≗ (cut⊗Rcases++₁ [] [] []
        {f = MIP.h Kg} {g = ax} {h = IR})))
      ∘ ⊗R (cutaxA-right (MIP.h Kg)) refl

    inner = ↜∷ (⊗R ax IR , eqg , eqh) refl
... | [] | H ∷ Δ₂
  rewrite ++?-inj₂ Γ (H ∷ Δ₂) (A' ⇒ B' ∷ Ξ₁) B |
          cases++-inj₁ Γ [] (H ∷ Δ₂) B |
          cases++-inj₂ (H ∷ Δ₂) [] Ξ₁ (A' ⇒ B') |
          cases++-inj₁ Γ Δ (F ∷ Ξ ++ B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₂ [] Γ Δ (B ⇐ A) |
          ++?-inj₂ Δ Ξ (B' ∷ Ξ₁) F =
  intrp≗ (~-trans (⇐L~⇐ refl inner)
    (g~ (⇐L⇒L-comm {Γ = Γ} {Δ₀ = F ∷ Ξ} {Δ₁ = H ∷ Δ₂}
      {Λ = []} {Ξ = Ξ₁})))
  where
    Df = mip Δ (F ∷ Ξ) [] f refl
    Kg = mip Γ (B ∷ []) (B' ∷ Ξ₁) g refl

    body : Γ ++ MIP.D Kg ∷ I ∷ H ∷ Δ₂ ++ A' ⇒ B' ∷ Ξ₁ ⊢ C
    body = ⇒L {Γ = Γ ++ MIP.D Kg ∷ []} {Δ = I ∷ H ∷ Δ₂} {Λ = Ξ₁}
      (IL {Γ = []} {Δ = H ∷ Δ₂} f') (MIP.g Kg)

    eqg : ⇒L {Γ = Γ ++ MIP.D Kg ∷ []} {Δ = H ∷ Δ₂} {Λ = Ξ₁} f' (MIP.g Kg) ≗
      cut Γ (⊗R ax IR) (⊗L {Γ = Γ} {Δ = H ∷ Δ₂ ++ A' ⇒ B' ∷ Ξ₁} body) refl
    eqg =
      ⇒L {Γ = Γ ++ MIP.D Kg ∷ []} (~ (cutIRIL [] (H ∷ Δ₂) {g = f'})) refl
      ∘
      (((~ (≡to≗ (cut⇒L-cases++-assoc [] (Γ ++ MIP.D Kg ∷ [])
        {Λ₀ = H ∷ Δ₂} {Λ₁ = Ξ₁}
        {f = IR} {g = IL {Γ = []} {Δ = H ∷ Δ₂} f'} {h = MIP.g Kg})))
      ∘
      (~ cutaxA-left Γ (cut (Γ ++ MIP.D Kg ∷ []) IR body refl) refl))
      ∘
      ≡to≗ (cut⊗R⊗Lcases++ Γ (H ∷ Δ₂ ++ A' ⇒ B' ∷ Ξ₁)
        {f = ax} {g = IR} {h = body}))

    eqh : cut [] (MIP.h Kg) (⊗R ax IR) refl ≗ ⊗R (MIP.h Kg) IR
    eqh =
      (~ (≡to≗ (cut⊗Rcases++₁ [] [] []
        {f = MIP.h Kg} {g = ax} {h = IR})))
      ∘ ⊗R (cutaxA-right (MIP.h Kg)) refl

    inner = ↜∷ (⊗R ax IR , eqg , eqh) refl
... | G ∷ Λ₂ | w
  rewrite ++?-inj₂ Γ (G ∷ Λ₂ ++ w) (A' ⇒ B' ∷ Ξ₁) B |
          cases++-inj₁ Γ (G ∷ Λ₂) w B |
          cases++-inj₂ (G ∷ Λ₂ ++ w) [] Ξ₁ (A' ⇒ B') |
          cases++-inj₁ Γ Δ (F ∷ Ξ ++ G ∷ Λ₂ ++ B' ∷ Ξ₁) (B ⇐ A) |
          cases++-inj₂ [] Γ Δ (B ⇐ A) |
          ++?-inj₂ Δ Ξ (G ∷ Λ₂ ++ B' ∷ Ξ₁) F =
  intrp≗ (g~ ⇐L⇒L-comm)
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₂ (x ∷ Ω'' , refl , refl) 
  with ++? Ω' Δ₀ Λ (Λ₁ ++ Δ₁ ++ A' ⇒ B' ∷ Ξ) eq2
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} eq | inj₁ (Ω' , refl , eq2) | inj₂ (x ∷ Ω'' , refl , refl) | inj₁ (Ω''' , eq3 , refl) 
  with ++? Ω''' Λ₁ Λ (Δ₁ ++ A' ⇒ B' ∷ Ξ) eq3
... | inj₁ (Ξ' , eq4 , refl)
  with cases++ Δ₁ Ξ' Ξ Λ (sym eq4) 
mip≗⇐L⇒L-comm Γ (E ∷ .(Ω'' ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Ξ')) Λ {.(Γ ++ E ∷ Ω'')} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} refl | inj₁ (.(Δ₀ ++ Λ₁ ++ Ξ') , refl , refl) | inj₂ (E ∷ Ω'' , refl , refl) | inj₁ (.(Λ₁ ++ Ξ') , refl , refl) | inj₁ (Ξ' , refl , refl) | inj₁ (Ξ'' , refl , refl)
  rewrite ++?-inj₂ Γ (Ω'' ++ B ∷ Λ₁ ++ Δ₁) (A' ⇒ B' ∷ Ξ'' ++ Λ) E |
          cases++-inj₁ Γ (Ω'' ++ B ∷ Λ₁) Δ₁ E |
          cases++-inj₁ (Ω'' ++ B ∷ Λ₁ ++ Δ₁) Ξ'' Λ (A' ⇒ B') |
          ++?-inj₂ Γ (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Δ₁) (A' ⇒ B' ∷ Ξ'' ++ Λ) E |
          cases++-inj₁ Γ (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Λ₁) Δ₁ E |
          cases++-inj₁ (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Δ₁) Ξ'' Λ (A' ⇒ B') |
          cases++-inj₁ (Γ ++ E ∷ Ω'') (Δ₀ ++ Λ₁ ++ B' ∷ Ξ'') Λ (B ⇐ A) |
          cases++-inj₂ (E ∷ Ω'') Γ (Δ₀ ++ Λ₁ ++ B' ∷ Ξ'') (B ⇐ A) |
          ++?-inj₁ (Λ₁ ++ B' ∷ Ξ'') Δ₀ Λ =
  intrp≗ (h~ (⇐L⇒L-comm {Γ = E ∷ Ω''} {Δ₀ = Δ₀}
    {Δ₁ = Δ₁} {Λ = Λ₁} {Ξ = Ξ''}))
mip≗⇐L⇒L-comm Γ (E ∷ .(Ω'' ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Ξ')) Λ {.(Γ ++ E ∷ Ω'')} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} refl | inj₁ (.(Δ₀ ++ Λ₁ ++ Ξ') , refl , refl) | inj₂ (E ∷ Ω'' , refl , refl) | inj₁ (.(Λ₁ ++ Ξ') , refl , refl) | inj₁ (Ξ' , eq4 , refl) | inj₂ (Ξ'' , refl , refl)
  rewrite ++?-inj₂ Γ (Ω'' ++ B ∷ Λ₁ ++ Ξ' ++ Ξ'') (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ Γ (Ω'' ++ B ∷ Λ₁) (Ξ' ++ Ξ'') E |
          cases++-inj₂ Ξ'' (Ω'' ++ B ∷ Λ₁ ++ Ξ') Ξ (A' ⇒ B') |
          ++?-inj₁ Ξ' (Ω'' ++ B ∷ Λ₁) Ξ'' |
          ++?-inj₂ Γ (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Ξ' ++ Ξ'') (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ Γ (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Λ₁) (Ξ' ++ Ξ'') E |
          cases++-inj₂ Ξ'' (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Λ₁ ++ Ξ') Ξ (A' ⇒ B') |
          ++?-inj₁ Ξ' (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Λ₁) Ξ'' |
          cases++-inj₁ (Γ ++ E ∷ Ω'') (Δ₀ ++ Λ₁) (B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₂ (E ∷ Ω'') Γ (Δ₀ ++ Λ₁) (B ⇐ A) |
          ++?-inj₁ Λ₁ Δ₀ (B' ∷ Ξ) =
  intrp≗ (h~ ⇐L⊗R₁)
mip≗⇐L⇒L-comm Γ (E ∷ .(Ω'' ++ B ⇐ A ∷ Δ₀ ++ Ω''')) Λ {.(Γ ++ E ∷ Ω'')} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} refl | inj₁ (.(Δ₀ ++ Ω''') , refl , refl) | inj₂ (E ∷ Ω'' , refl , refl) | inj₁ (Ω''' , refl , refl) | inj₂ (F , Ξ' , refl , refl)
  rewrite ++?-inj₂ Γ (Ω'' ++ B ∷ Ω''' ++ F ∷ Ξ' ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ Γ (Ω'' ++ B ∷ Ω''' ++ F ∷ Ξ') Δ₁ E |
          cases++-inj₂ (F ∷ Ξ' ++ Δ₁) (Ω'' ++ B ∷ Ω''') Ξ (A' ⇒ B') |
          ++?-inj₂ (Ω'' ++ B ∷ Ω''') Ξ' Δ₁ F |
          ++?-inj₂ Γ (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Ω''' ++ F ∷ Ξ' ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ Γ (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Ω''' ++ F ∷ Ξ') Δ₁ E |
          cases++-inj₂ (F ∷ Ξ' ++ Δ₁) (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Ω''') Ξ (A' ⇒ B') |
          ++?-inj₂ (Ω'' ++ B ⇐ A ∷ Δ₀ ++ Ω''') Ξ' Δ₁ F |
          cases++-inj₁ (Γ ++ E ∷ Ω'') (Δ₀ ++ Ω''') (F ∷ Ξ' ++ B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₂ (E ∷ Ω'') Γ (Δ₀ ++ Ω''') (B ⇐ A) |
          ++?-inj₁ Ω''' Δ₀ (F ∷ Ξ' ++ B' ∷ Ξ) =
  intrp≗ refl
mip≗⇐L⇒L-comm Γ (E ∷ .(Ω''' ++ B ⇐ A ∷ Ω')) Λ {.(Γ ++ E ∷ Ω''')} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₁ (Ω' , refl , refl) | inj₂ (E ∷ Ω''' , refl , refl) | inj₂ (F , Ω'' , refl , refl)
  with Λ₁
... | G ∷ Λ₂
  rewrite ++?-inj₂ Γ (Ω''' ++ B ∷ G ∷ Λ₂ ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ Γ (Ω''' ++ B ∷ G ∷ Λ₂) Δ₁ E |
          cases++-inj₂ (G ∷ Λ₂ ++ Δ₁) (Ω''' ++ B ∷ []) Ξ (A' ⇒ B') |
          ++?-inj₂ (Ω''' ++ B ∷ []) Λ₂ Δ₁ G |
          ++?-inj₂ Γ (Ω''' ++ B ⇐ A ∷ Ω' ++ F ∷ Ω'' ++ G ∷ Λ₂ ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ Γ (Ω''' ++ B ⇐ A ∷ Ω' ++ F ∷ Ω'' ++ G ∷ Λ₂) Δ₁ E |
          cases++-inj₂ (F ∷ Ω'' ++ G ∷ Λ₂ ++ Δ₁) (Ω''' ++ B ⇐ A ∷ Ω') Ξ (A' ⇒ B') |
          ++?-inj₂ (Ω''' ++ B ⇐ A ∷ Ω') (Ω'' ++ G ∷ Λ₂) Δ₁ F |
          cases++-inj₁ (Γ ++ E ∷ Ω''') Ω' (F ∷ Ω'' ++ G ∷ Λ₂ ++ B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₂ (E ∷ Ω''') Γ Ω' (B ⇐ A) |
          ++?-inj₂ Ω' Ω'' (G ∷ Λ₂ ++ B' ∷ Ξ) F =
  intrp≗ (g~ ⇐L⇒L-comm)
... | []
  rewrite ++?-inj₂ Γ (Ω''' ++ B ∷ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ Γ (Ω''' ++ B ∷ []) Δ₁ E |
          cases++-inj₂ Δ₁ (Ω''' ++ B ∷ []) Ξ (A' ⇒ B') |
          ++?-inj₁ {X = Fma} [] (Ω''' ++ B ∷ []) Δ₁ |
          ++?-inj₂ Γ (Ω''' ++ B ⇐ A ∷ Ω' ++ F ∷ Ω'' ++ Δ₁) (A' ⇒ B' ∷ Ξ) E |
          cases++-inj₁ Γ (Ω''' ++ B ⇐ A ∷ Ω' ++ F ∷ Ω'') Δ₁ E |
          cases++-inj₂ (F ∷ Ω'' ++ Δ₁) (Ω''' ++ B ⇐ A ∷ Ω') Ξ (A' ⇒ B') |
          ++?-inj₂ (Ω''' ++ B ⇐ A ∷ Ω') Ω'' Δ₁ F |
          cases++-inj₁ (Γ ++ E ∷ Ω''') Ω' (F ∷ Ω'' ++ B' ∷ Ξ) (B ⇐ A) |
          cases++-inj₂ (E ∷ Ω''') Γ Ω' (B ⇐ A) |
          ++?-inj₂ Ω' Ω'' (B' ∷ Ξ) F =
  intrp≗ (~-trans (⇐L~⇐ refl inner)
    (g~ (⇐L⇒L-comm {Γ = Γ} {Δ₀ = F ∷ Ω''} {Δ₁ = Δ₁}
      {Λ = []} {Ξ = Ξ})))
  where
    Df = mip Ω' (F ∷ Ω'') [] f refl
    Kg = mip Γ (E ∷ Ω''' ++ B ∷ []) (B' ∷ Ξ) g refl

    body : Γ ++ MIP.D Kg ∷ I ∷ Δ₁ ++ A' ⇒ B' ∷ Ξ ⊢ C
    body = ⇒L {Γ = Γ ++ MIP.D Kg ∷ []} {Δ = I ∷ Δ₁} {Λ = Ξ}
      (IL {Γ = []} {Δ = Δ₁} f') (MIP.g Kg)

    eqg : ⇒L {Γ = Γ ++ MIP.D Kg ∷ []} {Δ = Δ₁} {Λ = Ξ} f' (MIP.g Kg) ≗
      cut Γ (⊗R ax IR) (⊗L {Γ = Γ} {Δ = Δ₁ ++ A' ⇒ B' ∷ Ξ} body) refl
    eqg =
      ⇒L {Γ = Γ ++ MIP.D Kg ∷ []} (~ (cutIRIL [] Δ₁ {g = f'})) refl
      ∘
      (((~ (≡to≗ (cut⇒L-cases++-assoc [] (Γ ++ MIP.D Kg ∷ [])
        {Λ₀ = Δ₁} {Λ₁ = Ξ}
        {f = IR} {g = IL {Γ = []} {Δ = Δ₁} f'} {h = MIP.g Kg})))
      ∘
      (~ cutaxA-left Γ (cut (Γ ++ MIP.D Kg ∷ []) IR body refl) refl))
      ∘
      ≡to≗ (cut⊗R⊗Lcases++ Γ (Δ₁ ++ A' ⇒ B' ∷ Ξ)
        {f = ax} {g = IR} {h = body}))

    eqh : cut [] (MIP.h Kg) (⊗R ax IR) refl ≗ ⊗R (MIP.h Kg) IR
    eqh =
      (~ (≡to≗ (cut⊗Rcases++₁ [] [] []
        {f = MIP.h Kg} {g = ax} {h = IR})))
      ∘ ⊗R (cutaxA-right (MIP.h Kg)) refl

    inner = ↜∷ (⊗R ax IR , eqg , eqh) refl
mip≗⇐L⇒L-comm Γ (E ∷ Δ) Λ {Γ₁} {Δ₀} {Δ₁} {Λ₁} {Ξ} {A} {B} {A'} {B'} {C} {f} {f'} {g} refl | inj₂ (Ω' , refl , refl)
  with Ω'
... | []
  = intrp≗
      (~-trans
        (⇐L~Λ (mip⇒L~Λ∷ Γ (E ∷ Δ) B Λ₁ Ξ {Ω = Δ₁}) refl)
        (~-trans
          (g~ (⇐L⇒L-comm
            {Γ = Γ ++ mip Γ (E ∷ Δ) (B ∷ Λ₁ ++ B' ∷ Ξ) g refl .MIP.D ∷ []}
            {Δ₀ = Δ₀} {Δ₁ = Δ₁} {Λ = Λ₁} {Ξ = Ξ}))
          (~-trans
            (⇒L~Λ (~-sym (mip⇐L~Λ Γ (E ∷ Δ) [] (Λ₁ ++ B' ∷ Ξ))) refl)
            (~-sym
              (mip⇒L~Λ∷ Γ (E ∷ Δ) (B ⇐ A) (Δ₀ ++ Λ₁) Ξ
                {Ω = Δ₁})))))
... | H ∷ Ω₀
  = intrp≗
      (~-trans
        (⇐L~Λ (mip⇒L~Λ∷ Γ (E ∷ Δ) H (Ω₀ ++ B ∷ Λ₁) Ξ
          {Ω = Δ₁}) refl)
        (~-trans
          (g~ (⇐L⇒L-comm
            {Γ = Γ ++ mip Γ (E ∷ Δ) (H ∷ Ω₀ ++ B ∷ Λ₁ ++ B' ∷ Ξ) g refl .MIP.D ∷ H ∷ Ω₀}
            {Δ₀ = Δ₀} {Δ₁ = Δ₁} {Λ = Λ₁} {Ξ = Ξ}))
          (~-trans
            (⇒L~Λ
              (~-sym (mip⇐L~Λ Γ (E ∷ Δ) (H ∷ Ω₀) (Λ₁ ++ B' ∷ Ξ)))
              refl)
            (~-sym
              (mip⇒L~Λ∷ Γ (E ∷ Δ) H
                (Ω₀ ++ B ⇐ A ∷ Δ₀ ++ Λ₁) Ξ {Ω = Δ₁})))))
